{
  "id": "n4.bun-a-dakara-bun-b",
  "level": "N4",
  "description": "Express reason or cause; 'because', 'so', 'therefore'.",
  "formation": "Sentence A + だから + Sentence B",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- 〜だから（理由・原因）\n\n### Meaning and function\n- States a reason or cause for what follows: because; so; therefore\n- Often used to justify the speaker’s conclusion, request, warning, advice, or result in the following clause\n\n### Form and templates\n- N／な-adj + だから + S（result/conclusion）\n- N／な-adj + ですから + S（polite）\n- N／な-adj + だったから／でしたから + S（past reason）\n- N／な-adj + じゃないから／ではありませんから + S（negative reason; polite）\n- [Prior sentence or shared context]. だから、S（sentence-initial connector meaning “so; therefore”）\n\nNotes\n- だから is だ + から, so it follows nouns and な-adjectives. Do not use だから after verbs or い-adjectives; use 〜から or 〜ので there.\n- Keep register consistent: ですから pairs best with です／ます in S; だから pairs naturally with plain style.\n- Punctuation: either A だから、B or A。だから、B when A stands as a full sentence.\n\n### Usage notes and constraints\n- Register/naturalness: だから is casual-to-neutral and very common in speech. ですから is polite/formal (announcements, customer-facing speech, talking to superiors).\n- Tone: だから can sound direct/insistent; ですから is polite but still assertive. For softer, more objective reasons, 〜ので／〜ですので is often preferred.\n- Scope: A is the immediate reason; B is a result, the speaker’s judgment, or an action/request. Using だから to strongly justify commands or refusals is common in conversation.\n- Orthography: だから／ですから are typically written in kana. Colloquial negatives use じゃない; formal negatives use ではありません.\n\n### Common mistakes (optional, only if relevant)\n- Using だから after verbs or い-adjectives; use 〜から／〜ので instead.\n- Mixing registers (ですから + plain S, or だから + です／ます S) leading to awkward tone.\n- Overusing だから with superiors or in formal writing; it can sound blunt.\n- Not matching tense/negation of the reason (use だったから／じゃなかったから when the reason is past/negative).\n- Inserting particles between だ and から (nothing comes between them).\n\n### Related grammar (optional, only if relevant)\n- 〜から: General “because” attaching to verbs/い-adj (and N/な-adj with だ). More direct/subjective than 〜ので.\n- 〜ので／〜なので: Also “because”; softer/more objective; preferred in polite settings. なので is the N／な-adj counterpart.\n- それで: “So; and then” as a sentence-initial connector referring to the previous sentence; states a result without explicitly framing it as the speaker’s justification.\n- 〜からだ／〜からです: Sentence-ending “It’s because ...” used to present a reason by itself rather than connect to a following result.",
  "examples": [
    {
      "jp": "雨だから、今日は外に出ない。",
      "en": "Because it’s raining, I’m not going outside today."
    },
    {
      "jp": "学生ですから、学割になりますか。",
      "en": "Since I’m a student, can I get a student discount?"
    },
    {
      "jp": "無料だったから、試してみた。",
      "en": "Because it was free, I tried it."
    },
    {
      "jp": "会員じゃないから、ポイントは付かない。",
      "en": "Since I’m not a member, points won’t be added."
    },
    {
      "jp": "会員ではありませんから、こちらはご利用いただけません。",
      "en": "Since you are not a member, you cannot use this service."
    },
    {
      "jp": "静かだから、集中できる。",
      "en": "Because it’s quiet, I can concentrate."
    },
    {
      "jp": "危険ですから、近づかないでください。",
      "en": "It is dangerous, so please keep your distance."
    },
    {
      "jp": "休みでしたから、オフィスは閉まっていました。",
      "en": "Since it was a day off, the office was closed."
    },
    {
      "jp": "この道は危険だから、夜は通らないで。",
      "en": "This road is dangerous, so don’t go through it at night."
    },
    {
      "jp": "工事中です。ですから、左側の通路をご利用ください。",
      "en": "We are under construction. Therefore, please use the left passage."
    },
    {
      "jp": "電車が止まった。だから、遅刻したんだ。",
      "en": "The train stopped. That’s why I was late."
    },
    {
      "jp": "子どもだから、辛い料理は無理だ。",
      "en": "Because I’m a child, spicy food is too much for me."
    },
    {
      "jp": "それは冗談だから、気にしないで。",
      "en": "It’s a joke, so don’t worry about it."
    },
    {
      "jp": "便利だったから、前はよく使っていた。",
      "en": "Because it was convenient, I used it a lot before."
    },
    {
      "jp": "満席ですから、次の便にしますか。",
      "en": "Since it’s full, shall we take the next flight?"
    },
    {
      "jp": "会場が駅の近くの小さなホールだから、迷わないよ。",
      "en": "Since the venue is a small hall near the station, you won’t get lost."
    },
    {
      "jp": "元気じゃなかったから、昨日は行かなかった。",
      "en": "Since I wasn’t feeling well, I didn’t go yesterday."
    },
    {
      "jp": "とてもシンプルだから、説明がいらない。",
      "en": "Because it’s very simple, no explanation is needed."
    },
    {
      "jp": "社員証が必要です。ですから、受付でお見せいただけますか。",
      "en": "An ID badge is required. Therefore, could you show it at reception?"
    },
    {
      "jp": "大人ですから、責任を取ってください。",
      "en": "Since you’re an adult, please take responsibility."
    }
  ],
  "negativeExamples": [
    {
      "jp": "寒いから、コートを着る。",
      "en": "Because it’s cold, I wear a coat."
    },
    {
      "jp": "雨が降ったから、行かなかった。",
      "en": "Because it rained, I didn’t go."
    },
    {
      "jp": "静かなので、作業が進みます。",
      "en": "Because it’s quiet, the work progresses."
    },
    {
      "jp": "工事中ですので、ご注意ください。",
      "en": "As we are under construction, please be careful."
    },
    {
      "jp": "事故がありました。それで、渋滞しています。",
      "en": "There was an accident. So, there’s a traffic jam."
    },
    {
      "jp": "風邪のせいで、声が出ません。",
      "en": "Due to a cold, I can’t speak."
    },
    {
      "jp": "点検のために、エレベーターは止まっています。",
      "en": "Due to inspection, the elevator is stopped."
    },
    {
      "jp": "遅れたのは、電車が止まったからです。",
      "en": "The reason I was late is that the train stopped."
    },
    {
      "jp": "未成年なので、お酒は買えないのでしょうか。",
      "en": "Since I’m a minor, am I not allowed to buy alcohol?"
    },
    {
      "jp": "本日休業につき、入店できません。",
      "en": "We are closed today; therefore you cannot enter."
    }
  ]
}