{
  "id": "n4.bun-a-soreni-bun-b",
  "level": "N4",
  "description": "Express 'in addition to; besides,' used to include additional information.",
  "formation": "Sentence A + それに + Sentence B",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- 接続詞「それに」（追加）\n\n### Meaning and function\n- Adds another point, reason, or piece of information to what was just said: in addition; besides; furthermore; plus. The second sentence supports or continues the same direction as the first (same positive/negative orientation).\n\n### Form and templates\n- S1。それに、S2。\n- Optional (enumeration of items): N1、それに N2\n- Position: それに appears at the beginning of the added clause (S2). A comma after それに is common in writing.\n- Particle behavior: それに itself is a standalone connector (not a particle); no additional particle attaches to it.\n- Politeness: Works with both plain and polite sentence endings; それに does not change.\n- Co-occurrence: Often used when listing multiple reasons (e.g., after clauses ending in 〜し), and S2 may end with から/ので to explicitly mark it as “another reason.”\n\n### Usage notes and constraints\n- Register/naturalness: Very common in everyday speech and casual writing. For formal or written styles, そのうえ・加えて・さらに are preferred.\n- Semantic scope: Adds information of the same polarity; not used for contrast or contradiction. Not a time-sequencing connector.\n- Clause level: Functions as a sentence/independent-clause connector. Do not embed it as if modifying within a single clause.\n- Topic continuity: Typically adds to the same topic or evaluation as S1; a subject/topic switch is possible but should remain contextually related.\n- Orthography: Write in hiragana (それに). The kanji form 其れに is archaic and not used in modern writing.\n- Punctuation: A comma after それに is standard; a pause is natural in speech.\n\n### Common mistakes (optional, only if relevant)\n- Using それに to mean “and then/after that” (temporal sequence). Use それから or そして for sequence.\n- Using それに to express contrast (“however/nevertheless”). Use でも・しかし・それでも instead.\n- Placing それに mid-clause without a boundary. It should start the added clause.\n- Overusing それに in formal writing; prefer そのうえ・加えて・さらに.\n\n### Related grammar (optional, only if relevant)\n- それから: “and then/after that”; marks temporal or procedural sequence, not additive reasoning.\n- そして: Neutral “and”; links facts/events in order, weaker “plus” nuance than それに.\n- そのうえ／加えて: More formal “moreover/in addition”; suitable for essays and formal writing.\n- さらに: “further; even more”; can be a sentence connector or an adverb intensifying degree.\n- しかも: “moreover/what’s more” with a stronger, sometimes unexpected or emphatic addition; more forceful than それに.",
  "examples": [
    {
      "jp": "雨が降っている。それに、風も強い。",
      "en": "It’s raining. Besides, the wind is strong too."
    },
    {
      "jp": "この店は安いです。それに、量も多いですか。",
      "en": "This place is cheap. And are the portions large as well?"
    },
    {
      "jp": "今日は外出したくない。それに、体調もよくない。",
      "en": "I don’t want to go out today. Plus, I don’t feel well either."
    },
    {
      "jp": "会議はうまくいった。それに、相手も満足していた。",
      "en": "The meeting went well. Moreover, the other party was satisfied too."
    },
    {
      "jp": "発表は無事に終わりました。それに、質問も少なかったです。",
      "en": "The presentation ended without a hitch. In addition, there were few questions."
    },
    {
      "jp": "締め切りは明日ですよね。それに、資料はもう準備できましたか。",
      "en": "The deadline is tomorrow, right? Also, are the materials already prepared?"
    },
    {
      "jp": "立地がいいし、家賃も手頃だ。それに、ペット可なんだ。",
      "en": "The location is good and the rent is reasonable. Plus, pets are allowed."
    },
    {
      "jp": "駅から近い。それに、眺めもいいから。",
      "en": "It’s close to the station. Plus, the view is nice too."
    },
    {
      "jp": "このアプリは簡単に使える。それに、無料で試せます。",
      "en": "This app is easy to use. Furthermore, you can try it for free."
    },
    {
      "jp": "思ったより安く買えた。それに、品質も悪くなかった。",
      "en": "I got it cheaper than I expected. And the quality wasn’t bad either."
    },
    {
      "jp": "このコースは必要ありません。それに、時間もありません。",
      "en": "I don’t need this course. Besides, I don’t have time either."
    },
    {
      "jp": "パン、それにスープもください。",
      "en": "Bread, and also soup, please."
    },
    {
      "jp": "会費、それに交通費は各自で負担してください。",
      "en": "The membership fee, and also transportation costs, should be covered individually."
    },
    {
      "jp": "上司からのメール、それに社内掲示板の案内も確認した。",
      "en": "I checked the email from my supervisor and also the notice on the company bulletin board."
    },
    {
      "jp": "資料は十分ですか。それに、人数は何人来ますか。",
      "en": "Do we have enough materials? Also, how many people are coming?"
    },
    {
      "jp": "私は行かない。それに、同僚も行かない。",
      "en": "I’m not going. Plus, my coworker isn’t going either."
    },
    {
      "jp": "昨日見た映画は長かった。それに、映像がとてもきれいだった。",
      "en": "The movie we saw yesterday was long. Besides, the visuals were very beautiful."
    },
    {
      "jp": "この方法は簡単だ。それに、失敗しにくいので安心です。",
      "en": "This method is simple. And it’s reassuring because it’s hard to fail."
    },
    {
      "jp": "値段も安いし、口コミの評価も高い。それに、保証も付いているから買うつもりだ。",
      "en": "The price is low, and the reviews are good. Plus, it comes with a warranty, so I plan to buy it."
    },
    {
      "jp": "試験は難しくなかった。それに、時間にも余裕があった。",
      "en": "The exam wasn’t difficult. Besides, we had plenty of time."
    }
  ],
  "negativeExamples": [
    {
      "jp": "雨が降ってきた。それから、風が強くなった。",
      "en": "It started to rain. Then the wind got strong."
    },
    {
      "jp": "駅に着いた。そして、友だちに電話した。",
      "en": "I arrived at the station. And then I called a friend."
    },
    {
      "jp": "この店は安い。さらに、量も多い。",
      "en": "This place is cheap. Furthermore, the portions are big."
    },
    {
      "jp": "そのうえ、資料も充実している。",
      "en": "Moreover, the materials are substantial."
    },
    {
      "jp": "それにしても、今日は寒いですね。",
      "en": "Even so, it’s cold today."
    },
    {
      "jp": "それに対して、彼は何も言わなかった。",
      "en": "In contrast to that, he said nothing."
    },
    {
      "jp": "それについては、後ほどご連絡します。",
      "en": "Regarding that, I will contact you later."
    },
    {
      "jp": "それに関して、意見はありません。",
      "en": "As for that, I have no opinion."
    },
    {
      "jp": "それに気づかなかった。",
      "en": "I didn’t notice that."
    },
    {
      "jp": "それにしては、よくできている。",
      "en": "For that, it’s done quite well."
    }
  ]
}