{
  "id": "n4.noun-wo-morau",
  "level": "N4",
  "description": "To receive or get something from someone; 'to receive', 'to get'.",
  "formation": "Noun + を + もらう",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- Nをもらう（受け取り）\n\n### Meaning and function\n- Expresses that the subject (the receiver) gets/receives a thing from someone (the giver)\n\n### Form and templates\n- Core\n  - N1 は/が N2 に/から N3 を もらう\n  - Receiver (N1) marked by は/が; giver (N2) marked by に or から; received item (N3) marked by を\n- Politeness/tense\n  - Polite: もらいます\n  - Past: もらった／もらいました\n  - Negative: もらわない／もらいません\n  - Potential: もらえる／もらえます（possible/able to receive）\n- Particle notes\n  - に and から both mark the giver; から highlights “source,” に highlights the indirect object “from whom”\n  - With organizations/institutions or non-human sources, から is generally more natural; with people, both に and から are common\n- Ordering\n  - Giver phrase (N2に/から) typically precedes the item (N3を) before もらう\n- Optionality\n  - Giver phrase can be omitted when obvious from context\n  - The subject often appears as a topic (N1は); が focuses the receiver as new information\n\n### Usage notes and constraints\n- Register/naturalness\n  - Very common in speech and writing; neutral register\n  - Use いただく for a more formal/humble tone when the receiver is the speaker/in-group and the giver is higher in status\n- Semantics\n  - Focuses on the receiver’s viewpoint; the subject is the one who benefits by receiving the item\n  - Giver is typically animate (a person or organization). から with places/organizations is common\n  - Implies receiving from someone; do not use it when you obtained something by buying it yourself (use 買う in that case)\n  - Unlike くれる, もらう does not require the receiver to be the speaker/in-group, though it often is\n- Orthography\n  - もらう (hiragana) is standard in modern writing\n  - 貰う is also seen but is less common/formal\n\n### Common mistakes (optional, only if relevant)\n- Marking the giver with を instead of に/から\n- Confusing direction with あげる/くれる and choosing the wrong subject (receiver vs. giver)\n- Overusing に with non-person sources where から is more natural (e.g., shops/companies)\n- Using いただく when the receiver is not the speaker/in-group (いただく is humble; the receiver must be the speaker or their in-group)\n\n### Related grammar (optional, only if relevant)\n- Nをくれる: Giver is the subject; the receiver is the speaker/in-group. Same event, opposite viewpoint\n- Nをあげる: Subject gives to someone else; opposite direction of もらう\n- Nをいただく: Humble version of もらう; formal and respectful when receiving from a higher-status giver\n- Vて（を）もらう: Receive a favor in the form of an action (“have someone do something for me”); benefactive action form\n- Nを受け取る: “Accept/receive” with a more formal or physical handover nuance; less benefactive than もらう",
  "examples": [
    {
      "jp": "私はよく友だちに古い漫画をもらう。",
      "en": "I often get old manga from friends."
    },
    {
      "jp": "昨日、姉から傘をもらった。",
      "en": "Yesterday I got an umbrella from my older sister."
    },
    {
      "jp": "私が田中さんから地図をもらいました。",
      "en": "I received a map from Mr./Ms. Tanaka."
    },
    {
      "jp": "子どもは祖父にお小遣いをもらって、うれしそうだ。",
      "en": "The child got an allowance from his grandpa and looks happy."
    },
    {
      "jp": "彼は誰からも招待状をもらわない。",
      "en": "He doesn’t receive invitations from anyone."
    },
    {
      "jp": "私はアプリから領収書をもらいません。",
      "en": "I don’t receive receipts from the app."
    },
    {
      "jp": "この申請なら、市役所から許可をもらえます。",
      "en": "With this application, you can get approval from city hall."
    },
    {
      "jp": "未成年は銀行からクレジットカードをもらえない。",
      "en": "Minors can’t receive a credit card from a bank."
    },
    {
      "jp": "どこからその資料をもらいましたか。",
      "en": "Where did you get those materials from?"
    },
    {
      "jp": "誰にそのメモをもらった？",
      "en": "Who did you get that memo from?"
    },
    {
      "jp": "私は部長に直接、詳しい説明をもらいました。",
      "en": "I directly received a detailed explanation from the department manager."
    },
    {
      "jp": "留学生は大学から奨学金をもらった。",
      "en": "The international student received a scholarship from the university."
    },
    {
      "jp": "うちは毎週、農家から新鮮な野菜をもらいます。",
      "en": "Our family receives fresh vegetables from a farmer every week."
    },
    {
      "jp": "私は昨日、プレゼントをもらった。",
      "en": "I got a present yesterday."
    },
    {
      "jp": "彼女は友だちから励ましの言葉をもらい、元気になった。",
      "en": "She received words of encouragement from a friend and felt better."
    },
    {
      "jp": "私は取引先の会社からサンプルを貰いました。",
      "en": "I received samples from a client company."
    },
    {
      "jp": "私は祖母に手編みのマフラーを貰えるはずだ。",
      "en": "I should be able to receive a hand‑knitted scarf from my grandmother."
    },
    {
      "jp": "あのイベントでは、来場者が受付でステッカーをもらえる。",
      "en": "At that event, attendees can get stickers at the reception desk."
    },
    {
      "jp": "私は昨日、同僚に急ぎの連絡をもらいませんでした。",
      "en": "I didn’t receive the urgent message from my coworker yesterday."
    },
    {
      "jp": "その子はサンタさんに手紙の返事をもらえましたか。",
      "en": "Did that child manage to get a reply to the letter from Santa?"
    }
  ],
  "negativeExamples": [
    {
      "jp": "先生に手伝ってもらった。",
      "en": "I had the teacher help me."
    },
    {
      "jp": "先輩からアドバイスをいただきました。",
      "en": "I humbly received advice from my senior."
    },
    {
      "jp": "母は私に本をくれた。",
      "en": "My mother gave me a book."
    },
    {
      "jp": "配達員から荷物を受け取りました。",
      "en": "I accepted the package from the delivery person."
    },
    {
      "jp": "友だちからの手紙を読んだ。",
      "en": "I read a letter from a friend."
    },
    {
      "jp": "これはもらいものだから、大切にしている。",
      "en": "Since this was a gift I received, I take good care of it."
    },
    {
      "jp": "あの子猫は新しい家族にもらわれた。",
      "en": "That kitten was adopted by a new family."
    },
    {
      "jp": "私は自分でチケットを買った。",
      "en": "I bought the ticket myself."
    },
    {
      "jp": "会社からのお知らせを確認してください。",
      "en": "Please check the notice from the company."
    },
    {
      "jp": "父に新しい靴を買ってもらった。",
      "en": "I had my father buy me new shoes."
    }
  ]
}