{
  "id": "n4.node",
  "level": "N4",
  "description": "Express a reason or a cause for something; 'because', 'since', 'so'.",
  "formation": "Verb-casual + ので, い-Adjective + ので, な-Adjective + なので, Noun + なので",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- 〜ので（理由・原因）\n\n### Meaning and function\n- Because; since. Presents an objective, background reason or cause and softens the tone of explanations, apologies, and requests.\n\n### Form and templates\n- Reason clause (plain form) + ので + result clause\n  - V(plain) + ので\n  - い-adj + ので\n  - な-adj + な + ので\n  - N + な + ので\n\n- Negative (reason clause)\n  - V(ない) + ので\n  - い-adj(〜くない) + ので\n  - な-adj/N + ではない（じゃない, casual）+ ので\n\n- Past (reason clause)\n  - V(た) + ので\n  - い-adj(〜かった) + ので\n  - な-adj/N + だった（でした, polite）+ ので\n\n- Particle/conjugation requirements and ordering\n  - After nouns and な-adjectives, use な before ので (なので). Do not use だ directly before ので in the present.\n  - The ので-clause states the reason and comes before the main/result clause.\n  - The reason clause is normally in plain form even if the main clause is polite.\n\n- Optional/alternative polite shaping\n  - In formal/business Japanese, you will also see polite forms directly before ので (ですので／でしたので／ますので). This is common in announcements, emails, and customer service language.\n\n### Usage notes and constraints\n- Register/naturalness\n  - Neutral-to-polite, often preferred over から when you want to sound softer or more courteous.\n  - Very natural in explanations, notices, and when giving reasons to superiors or customers.\n\n- Semantic nuance\n  - Tends to present the reason as objective background circumstances, sounding less assertive than から.\n  - Works well with polite requests and apologies to soften the impact. For strong, direct commands or firm personal judgments, から is more common.\n\n- Form constraints\n  - Keep the ので clause in plain form in ordinary speech; switch to です／ます before ので mainly in formal writing/speech.\n  - With な-adjectives and nouns, use なので (present), だったので／でしたので (past), ではないので／じゃないので (negative).\n\n- Orthographic variants\n  - No spelling variants. Note the fixed な before ので for nouns/な-adjectives (なので).\n\n### Common mistakes (optional, only if relevant)\n- Using だ + ので for present-tense nouns/な-adjectives; it must be な + ので (なので).\n- Adding な after verbs or い-adjectives (only nouns/な-adjectives take な).\n- Overusing ます／です before ので in casual speech, causing an overly stiff or mixed register.\n- Using ので when you want to assign blame or emphasize a negative cause; せいで is a better choice for “because of (bad cause).”\n\n### Related grammar (optional, only if relevant)\n- 〜から: Also “because,” but more direct/subjective; common with firm commands or personal decisions.\n- 〜ため（に）: More formal/objective; can express both cause and purpose; heavier, written tone.\n- 〜せいで: “Because of (a bad cause)”; used when the outcome is undesirable and you want to ascribe blame.\n- 〜おかげで: “Thanks to (a good cause)”; used when the outcome is positive.",
  "examples": [
    {
      "jp": "雨なので、今日は家にいます。",
      "en": "Because it's raining, I'll stay home today."
    },
    {
      "jp": "私は明日出張なので、会議には出られません。",
      "en": "I have a business trip tomorrow, so I can't attend the meeting."
    },
    {
      "jp": "祝日ではないので、学校は通常どおりです。",
      "en": "Since it isn't a holiday, school is as usual."
    },
    {
      "jp": "部屋がきれいなので、気持ちよく過ごせます。",
      "en": "Because the room is clean, I can spend time comfortably."
    },
    {
      "jp": "不便だったので、先月引っ越しました。",
      "en": "Because it was inconvenient, I moved last month."
    },
    {
      "jp": "急用でしたので、先に失礼いたしました。",
      "en": "As something urgent came up, I excused myself earlier."
    },
    {
      "jp": "寒いので、暖房をつけてもいいですか。",
      "en": "It's cold, so may I turn on the heater?"
    },
    {
      "jp": "値段が高くないので、この型にします。",
      "en": "Since the price isn't high, I'll go with this model."
    },
    {
      "jp": "暑かったので、昨日は早く寝た。",
      "en": "Because it was hot, I went to bed early yesterday."
    },
    {
      "jp": "子どもが起きているので、今は電話できません。",
      "en": "Since the kids are awake, I can't talk on the phone now."
    },
    {
      "jp": "電車が止まったので、タクシーで行きました。",
      "en": "The train stopped, so I went by taxi."
    },
    {
      "jp": "現金を持っていないので、カードで払います。",
      "en": "I don't have cash, so I'll pay by card."
    },
    {
      "jp": "早く起きられないので、朝の会議は厳しいです。",
      "en": "I can't get up early, so morning meetings are tough."
    },
    {
      "jp": "少々時間をいただきますので、こちらでお待ちください。",
      "en": "We will need a little time, so please wait here."
    },
    {
      "jp": "遅れて到着しましたので、後ほどご挨拶に伺います。",
      "en": "I arrived late, so I will come greet you later."
    },
    {
      "jp": "本日は満席ですので、少々お待ちいただけますか。",
      "en": "We are fully booked today, so could you please wait a moment?"
    },
    {
      "jp": "今日は雨じゃないので、散歩しませんか。",
      "en": "It isn't raining today, so shall we take a walk?"
    },
    {
      "jp": "担当が不在ですので、折り返しご連絡いたします。",
      "en": "The person in charge is away, so we will get back to you."
    },
    {
      "jp": "学生だったので、当時はお金がなかった。",
      "en": "Since I was a student, I didn't have money back then."
    },
    {
      "jp": "雨で足元が悪いので、慎重に歩いてください。",
      "en": "The ground is slippery because of the rain, so please walk carefully."
    }
  ],
  "negativeExamples": [
    {
      "jp": "雨だから、今日は走らない。",
      "en": "Because it's raining, I won't run today."
    },
    {
      "jp": "本日は満席のため、ご案内できません。",
      "en": "Due to being full today, we cannot seat you."
    },
    {
      "jp": "事故のせいで、電車が遅れた。",
      "en": "Because of the accident, the train was delayed."
    },
    {
      "jp": "外は寒いですから、早めに帰りましょう。",
      "en": "Since it's cold outside, let's head back early."
    },
    {
      "jp": "会議中のため、お電話に出られません。",
      "en": "Due to being in a meeting, I can't answer the phone."
    },
    {
      "jp": "私のでよければ、お貸しします。",
      "en": "If mine is okay, I'll lend it to you."
    },
    {
      "jp": "駅の出口で待っています。",
      "en": "I'll be waiting at the station exit."
    },
    {
      "jp": "遅れたもので、ご迷惑をおかけしました。",
      "en": "I was late, so I caused you trouble."
    },
    {
      "jp": "雨ではなく、雪でした。",
      "en": "It wasn't rain; it was snow."
    },
    {
      "jp": "ここは静かだし、眺めもいい。",
      "en": "It's quiet here, and the view is nice too."
    }
  ]
}