{
  "id": "n4.nagara",
  "level": "N4",
  "description": "Expresses 'while' or 'as' in the sense of doing two things simultaneously.",
  "formation": "Verb-masu stem + ながら",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- 〜ながら（同時動作）\n\n### Meaning and function\n- Expresses doing two actions at the same time by the same subject. The 〜ながら clause sets a background/secondary action; the main clause is the primary action.\n\n### Form and templates\n- Core:\n  - V(ます-stem) + ながら、Main clause\n  - V1(ます-stem) + ながら V2（…）\n- Particle placement:\n  - Objects, locations, instruments, companions, etc. attach to the 〜ながら verb before ながら:\n    - N(を/に/で/と/へ/から など) + V(ます-stem) + ながら、Main clause\n- する-verbs:\n  - N + を + しながら、Main clause\n  - Or directly しながら when the action する is clear from context\n- Tense/politeness:\n  - Tense and politeness are carried only by the main clause. The 〜ながら verb itself is a stem form (no ます/ない/た on it).\n- Optional/alternative:\n  - Typically the 〜ながら clause comes before the main predicate. Multiple 〜ながら phrases can be stacked, but overuse sounds heavy.\n  - Negative “while not doing …” is generally expressed with 〜ないで/〜ずに rather than V(ます-stem)+ながら.\n\n### Usage notes and constraints\n- Register and frequency:\n  - Neutral and very common in speech and writing. A concise, everyday pattern. More formal alternative: V(ます-stem)+つつ.\n- Same-subject requirement:\n  - Both actions are performed by the same subject. If subjects differ, use 〜あいだ／〜あいだに (間/間に).\n- Information structure:\n  - Put the less important/background action in the 〜ながら clause and the main/important action in the main clause.\n- Semantic scope:\n  - Describes actions that can plausibly occur simultaneously. Not for sequences that require completion of one action before the other (use 〜てから, etc.).\n- Aspect:\n  - The 〜ながら clause cannot take tense/aspect/negation directly. Ongoingness is inherent; any explicit aspect appears in the main clause if needed.\n- Category limits:\n  - This simultaneous-action use attaches to verbs only. Nouns/adjectives + ながら express a different, concessive meaning (“although”) and are a separate grammar point.\n- Orthography:\n  - Write in hiragana: ながら. The kanji 乍ら is archaic and not used in modern writing.\n\n### Common mistakes (optional, only if relevant)\n- Using different subjects in the two clauses; 〜ながら requires the same subject.\n- Adding inflection to the 〜ながら verb (e.g., Vますながら, Vたながら, Vないながら). Use the bare ます-stem.\n- Forcing logically incompatible actions into a 〜ながら construction.\n- Putting the main/important action in the 〜ながら clause, which flips the intended emphasis.\n- Using 〜ながら to mean “without doing …”; use 〜ないで/〜ずに instead.\n\n### Related grammar (optional, only if relevant)\n- V(ます-stem)+つつ: Also “while …,” more formal/literary; same-subject; often emphasizes an ongoing process or internal state.\n- 〜あいだ／〜あいだに（間／間に）: “While/during …”; can allow different subjects; 間 covers the whole span, 間に marks something that happens at some point during that span.\n- 〜ないで／〜ずに: “Without doing …”; negative counterpart for concurrent/preceding non-performance.\n- 〜たまま: “While remaining/as is …”; focuses on a continuing state rather than two active, simultaneous actions.",
  "examples": [
    {
      "jp": "音楽を聞きながら勉強します。",
      "en": "I study while listening to music."
    },
    {
      "jp": "コーヒーを飲みながら、本を読んだ。",
      "en": "I read a book while drinking coffee."
    },
    {
      "jp": "友達と話しながら駅へ向かっています。",
      "en": "I’m heading to the station while talking with a friend."
    },
    {
      "jp": "傘をさしながら走らないでください。",
      "en": "Please don’t run while holding an umbrella."
    },
    {
      "jp": "公園で走りながら歌った。",
      "en": "I sang while running in the park."
    },
    {
      "jp": "テレビを見ながらご飯は食べません。",
      "en": "I don’t eat meals while watching TV."
    },
    {
      "jp": "歩きながら電話してもいいですか。",
      "en": "Is it okay to make a phone call while walking?"
    },
    {
      "jp": "子どもをあやしながら、夕飯を作っていた。",
      "en": "I was cooking dinner while soothing my child."
    },
    {
      "jp": "彼はメッセージを打ちながら電車を待っていた。",
      "en": "He was waiting for the train while typing a message."
    },
    {
      "jp": "ニュースを聞きながら、朝の体操はしなかった。",
      "en": "I didn’t do my morning exercises while listening to the news."
    },
    {
      "jp": "ラジオを聞きながら、静かに掃除をしました。",
      "en": "I quietly cleaned while listening to the radio."
    },
    {
      "jp": "スマホで地図を見ながら、ゆっくり歩いた。",
      "en": "I walked slowly while checking the map on my phone."
    },
    {
      "jp": "メモを取りながら、説明を聞きました。",
      "en": "I listened to the explanation while taking notes."
    },
    {
      "jp": "動画を見ながら、料理している。",
      "en": "I’m cooking while watching a video."
    },
    {
      "jp": "電車に乗りながら、メールを返した。",
      "en": "I replied to emails while riding the train."
    },
    {
      "jp": "それ、音楽を聞きながらでもできますか。",
      "en": "Can you do that even while listening to music?"
    },
    {
      "jp": "イヤホンで音楽を聞きながら、地図を見ながら歩いた。",
      "en": "I walked while listening to music with earphones and also while looking at the map."
    },
    {
      "jp": "同僚と雑談しながら、資料をまとめました。",
      "en": "I organized the materials while chatting with a coworker."
    },
    {
      "jp": "彼は考えごとをしながら、返事をしなかった。",
      "en": "He didn’t respond while being lost in thought."
    },
    {
      "jp": "雨の音を聞きながら、ぐっすり眠った。",
      "en": "I fell fast asleep while listening to the sound of rain."
    }
  ],
  "negativeExamples": [
    {
      "jp": "残念ながら、本日は営業しておりません。",
      "en": "Unfortunately, we are closed today."
    },
    {
      "jp": "子供ながら、彼は礼儀正しい。",
      "en": "Though he is a child, he is polite."
    },
    {
      "jp": "生まれながらに、彼女は音感がいい。",
      "en": "She has a good ear for music by nature."
    },
    {
      "jp": "音楽を聞きつつ勉強した。",
      "en": "I studied while listening to music."
    },
    {
      "jp": "私が勉強している間、弟はゲームをしていた。",
      "en": "While I was studying, my younger brother was playing games."
    },
    {
      "jp": "歩かないで電話してください。",
      "en": "Please make the call without walking."
    },
    {
      "jp": "危険と知りながらも、彼は進んだ。",
      "en": "Even though he knew it was dangerous, he went on."
    },
    {
      "jp": "歩きながらの通話は禁止です。",
      "en": "Phone calls while walking are prohibited."
    },
    {
      "jp": "微力ながら、お力になりたい。",
      "en": "Though my ability is limited, I’d like to help."
    },
    {
      "jp": "食べてから勉強します。",
      "en": "I’ll study after eating."
    }
  ]
}