{
  "id": "n4.noun-wo-ageru",
  "level": "N4",
  "description": "To give something to someone; 'give', 'offer', 'present'.",
  "formation": "Noun + を + あげる",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- Nをあげる（与える）\n\n### Meaning and function\n- Expresses “to give/offer/present something to someone” from the giver’s viewpoint\n\n### Form and templates\n- Core template:\n  - Giver は/が Recipient に N を あげる\n- Particles and ordering:\n  - Recipient is marked with に (not へ, not と)\n  - The default, natural order is Recipient に → N を → あげる\n  - N を → Recipient に → あげる is possible but less neutral; use the default order unless you have a reason to focus/contrast\n  - Giver is commonly marked with は (topic); が is used when identifying/emphasizing the giver\n- Optional/alternative parts:\n  - Giver or Recipient may be omitted if understood from context\n  - 〜にも is possible when Recipient is included among others\n- Conjugation notes:\n  - Ichidan verb: あげます (polite), あげた (past), あげない／あげません (negative), あげよう (volitional), あげて (て-form)\n  - Very polite/humble alternative when the speaker’s side gives to someone higher: 差し上げる（〜します）\n\n### Usage notes and constraints\n- Register/naturalness:\n  - Everyday neutral verb; use あげます in polite speech\n  - In formal/business or to show respect toward the recipient, prefer 差し上げます\n  - やる is a rough/casual alternative often used toward animals, plants, children; to people it can sound rude\n- Viewpoint/semantic constraints:\n  - Giver-centered verb: use when focusing on the giver’s act or when the giver is the speaker/ingroup giving outward\n  - Do not use when the recipient is the speaker/ingroup from the speaker’s perspective; use くれる/くださる instead\n- Scope:\n  - N can be tangible (objects, money) or intangible (time, help, advice)\n  - Use に for the recipient; から marks source with もらう, not with あげる\n- Orthography:\n  - Usually written in kana for “to give (a gift)” to avoid confusion with 上げる/挙げる\n  - 差し上げる may be written in kanji or kana; both are common in formal contexts\n\n### Common mistakes (optional, only if relevant)\n- Marking the recipient with へ or と; the recipient must take に\n- Saying あげる when the recipient is “me/us” (speaker/ingroup); use くれる/くださる\n- Using やる toward adults or superiors; it can sound rude\n- Overusing the kanji 上げる for the “gift” meaning; prefer kana あげる\n\n### Related grammar (optional, only if relevant)\n- Nをくれる／くださる: Receiver-centered; used when the recipient is the speaker/ingroup (くださる is honorific)\n- Nをもらう／いただく: “To receive”; recipient-centered; the giver is marked by に/から (いただく is humble)\n- Vてあげる: “Do something for someone” (an action is given, not a thing); humble: 〜て差し上げる\n- 与える: Formal “to grant/affect/bestow”; common with abstract nouns (e.g., 影響), not the default for everyday gifting",
  "examples": [
    {
      "jp": "私は妹に本をあげた。",
      "en": "I gave a book to my younger sister."
    },
    {
      "jp": "先生に花を差し上げます。",
      "en": "I will humbly present flowers to the teacher."
    },
    {
      "jp": "私が彼に時計をあげました。",
      "en": "I was the one who gave him a watch."
    },
    {
      "jp": "彼女にプレゼントをあげない。",
      "en": "I’m not giving her a present."
    },
    {
      "jp": "先輩にはお土産をあげませんでした。",
      "en": "I didn’t give a souvenir to my senior."
    },
    {
      "jp": "この本を彼女にあげる。",
      "en": "I’ll give this book to her."
    },
    {
      "jp": "だれにチョコレートをあげますか。",
      "en": "Who will you give the chocolate to?"
    },
    {
      "jp": "後輩にも飴をあげます。",
      "en": "I’ll give candy to my junior as well."
    },
    {
      "jp": "それ、彼にあげて。",
      "en": "Give that to him."
    },
    {
      "jp": "子どもたちにもお菓子をたくさんあげた。",
      "en": "I gave lots of snacks to the kids too."
    },
    {
      "jp": "うちは近所の人に野菜をあげることがある。",
      "en": "We sometimes give vegetables to the neighbors."
    },
    {
      "jp": "当社は取引先に見本を差し上げます。",
      "en": "Our company will present samples to our clients."
    },
    {
      "jp": "友だちに傘をあげようか。",
      "en": "Shall I give an umbrella to my friend?"
    },
    {
      "jp": "どなたにこのパンフレットを差し上げればよろしいですか。",
      "en": "To whom should I give this brochure?"
    },
    {
      "jp": "猫に水をあげて、すぐに出かけた。",
      "en": "I gave the cat some water and then left right away."
    },
    {
      "jp": "この本、あげるよ。",
      "en": "I’ll give you this book."
    },
    {
      "jp": "誰が彼女に花束をあげたの？",
      "en": "Who gave her the bouquet?"
    },
    {
      "jp": "彼にはお金はあげないよ。",
      "en": "I’m not giving him any money."
    },
    {
      "jp": "先輩にこのメモをあげてください。",
      "en": "Please give this memo to our senior colleague."
    },
    {
      "jp": "彼にあげた本は、とても喜ばれた。",
      "en": "The book I gave him was very well received."
    }
  ],
  "negativeExamples": [
    {
      "jp": "彼は私に本をくれた。",
      "en": "He gave me a book."
    },
    {
      "jp": "部長が新人を励ましてあげた。",
      "en": "The manager encouraged the new employee (for their sake)."
    },
    {
      "jp": "彼女は猫に水をやった。",
      "en": "She gave water to the cat."
    },
    {
      "jp": "温度を上げてから、鍋に具を入れます。",
      "en": "After raising the temperature, I put the ingredients in the pot."
    },
    {
      "jp": "例を挙げると、すぐ分かります。",
      "en": "To give an example, you’ll understand right away."
    },
    {
      "jp": "その店は値段を上げたらしい。",
      "en": "It seems that store raised its prices."
    },
    {
      "jp": "先生から鉛筆をもらいました。",
      "en": "I received a pencil from the teacher."
    },
    {
      "jp": "取引先へ資料を送ります。",
      "en": "We will send materials to the client."
    },
    {
      "jp": "名前を挙げてください。",
      "en": "Please give a name (as an example)."
    },
    {
      "jp": "友だちに電話してあげるね。",
      "en": "I’ll call for my friend (as a favor)."
    }
  ]
}