{
  "id": "n4.tsumori",
  "level": "N4",
  "description": "Express the intention, plan, or determination to do something; 'I intend to', 'I plan to', 'I'm determined to'.",
  "formation": "Verb-casual + つもり",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- 意志・予定の〜つもり\n\n### Meaning and function\n- States the speaker’s intention, plan, or determination to do or not do something. Also used to ask about or report someone’s intended actions (often via quoting or inference).\n\n### Form and templates\n- V(dict) + つもりだ/です\n- V(ない) + つもりだ/です\n- V(dict) + つもりはない／つもりがない\n- V(dict) + つもりだった／でした (past intention)\n- V(ない) + つもりだった／でした (past negative intention)\n- V(dict) + つもりで + V/いる/行く/来る… (do something with the intention of …)\n- V(dict) + つもりでいる (maintain an ongoing, firm intention)\n- V(dict) + つもりはある／つもりがある (have the intention; often in contrasts)\n- Particle/ordering notes:\n  - つもり is a noun; take the copula だ/です (casual だ may be dropped).\n  - In negatives, は adds contrast/emphasis (つもりはない), が is more neutral (つもりがない).\n  - で links to a following clause (…つもりで…).\n- Conjugation notes:\n  - The verb before つもり must be in plain form (dictionary/ない). Do not use ます-form before つもり.\n  - Past intention uses the copula in the past (…つもりだった/でした).\n- Scope limits:\n  - Typically attaches to verbs. For nouns, N のつもり is a different pattern meaning “regarding/thinking of oneself as N,” not “intend to become N.”\n\n### Usage notes and constraints\n- Register: Neutral and common in both speech and writing. Use です for polite contexts; だ or zero-copula in casual.\n- Person/subject: Most natural for the speaker’s own intention. For others’ intentions, use quoting or hearsay/inference (〜つもりだと言っている／〜つもりらしい).\n- Semantics:\n  - Expresses subjective volition. Not used for non-volitional or uncontrollable events.\n  - For objective, set schedules/appointments, 〜予定だ／〜予定がある is usually more appropriate.\n  - For decisions/resolutions, 〜ことにする/した adds a stronger “decide” nuance than 〜つもりだ.\n  - 〜つもりでいる strengthens the sense of firm, continuing intention.\n- Orthography: つもり is normally written in kana. The kanji 積もり exists but is uncommon and not recommended.\n\n### Common mistakes (optional, only if relevant)\n- Using ます-form before つもり (e.g., Vますつもり): the verb must be plain (dictionary/ない).\n- Using つもり for non-volitional or external events (weather, others’ states) where intention is impossible.\n- Confusing V-たつもりだ (believe one has done) with past intention; past intention is V(dict) + つもりだった, not V-たつもりだ.\n- Using N のつもり to mean “intend to become N” instead of V になるつもり.\n- Stating a third person’s intention as fact without quoting/inference, which can sound presumptive.\n\n### Related grammar (optional, only if relevant)\n- 〜たい: expresses desire (“want to”); weaker commitment and focuses on feeling rather than plan.\n- 〜予定だ／〜予定がある: objective schedule/arrangement; suitable for formal or external plans beyond personal will.\n- 〜ことにする／〜ことにしている: making/maintaining a decision; stronger “decide/resolution” nuance than つもり.\n- 〜つもりで: “with the intention of …”; marks manner/purpose within another action.\n- V-たつもりだ: “believe/assume one has done”; contrasts with V(dict) + つもりだった (had intended to do but possibly didn’t).",
  "examples": [
    {
      "jp": "来年引っ越すつもりです。",
      "en": "I plan to move next year."
    },
    {
      "jp": "今日は甘いものは食べないつもりだ。",
      "en": "I intend not to eat sweets today."
    },
    {
      "jp": "私は参加するつもりはない。",
      "en": "I have no intention of participating."
    },
    {
      "jp": "結婚するつもりがない。",
      "en": "I have no intention of getting married."
    },
    {
      "jp": "先週は早く帰るつもりでしたが、残業になりました。",
      "en": "I intended to go home early last week, but I ended up working overtime."
    },
    {
      "jp": "大学では車を買わないつもりだった。",
      "en": "I wasn’t planning to buy a car in college."
    },
    {
      "jp": "貯金するつもりでお弁当を作っています。",
      "en": "I’m making my own lunch with the intention of saving money."
    },
    {
      "jp": "質問するつもりで先生の部屋に行った。",
      "en": "I went to the teacher’s office intending to ask questions."
    },
    {
      "jp": "当分はここで働くつもりでいる。",
      "en": "I intend to keep working here for the time being."
    },
    {
      "jp": "留学するつもりはあるが、時期は未定だ。",
      "en": "I do intend to study abroad, but the timing is undecided."
    },
    {
      "jp": "コンテストに応募するつもりがある。",
      "en": "I have the intention to apply for the contest."
    },
    {
      "jp": "彼は会社を辞めるつもりだと言っている。",
      "en": "He says he intends to quit the company."
    },
    {
      "jp": "あの人は海外に移住するつもりらしい。",
      "en": "It seems that person intends to move overseas."
    },
    {
      "jp": "明日の会議には出席するつもりですか。",
      "en": "Do you plan to attend tomorrow’s meeting?"
    },
    {
      "jp": "今夜は運動するつもり？",
      "en": "Are you planning to work out tonight?"
    },
    {
      "jp": "今月は外食しないつもりです。",
      "en": "I plan not to eat out this month."
    },
    {
      "jp": "一度は諦めるつもりだったが、また挑戦する。",
      "en": "I was going to give up once, but I’ll try again."
    },
    {
      "jp": "ここで一旦休むつもり。",
      "en": "I’m going to take a short break here."
    },
    {
      "jp": "急ぐつもりがないなら、先に行きますね。",
      "en": "If you don’t intend to hurry, I’ll go ahead."
    },
    {
      "jp": "体力を戻すつもりで毎朝走っている。",
      "en": "I run every morning with the intention of regaining my stamina."
    }
  ],
  "negativeExamples": [
    {
      "jp": "宿題はもう終わったつもりだ。",
      "en": "I assume the homework is already done."
    },
    {
      "jp": "来週は出張する予定です。",
      "en": "I have a business trip scheduled next week."
    },
    {
      "jp": "来月から貯金することにした。",
      "en": "I’ve decided to start saving money next month."
    },
    {
      "jp": "今日は早く帰りたい。",
      "en": "I want to go home early today."
    },
    {
      "jp": "彼は冗談のつもりで言った。",
      "en": "He said it as a joke."
    },
    {
      "jp": "そのつもりはありませんか。",
      "en": "Don’t you have that intention?"
    },
    {
      "jp": "自分では親切にしたつもりだった。",
      "en": "I thought I was being kind."
    },
    {
      "jp": "忘れたつもりで一からやり直そう。",
      "en": "Let’s start over as if we’ve forgotten."
    },
    {
      "jp": "私は行く予定はない。",
      "en": "I have no plan to go."
    },
    {
      "jp": "来年こそ留学する予定だそうだ。",
      "en": "I hear he is scheduled to study abroad next year."
    }
  ]
}