{
  "id": "n4.te-shimau",
  "level": "N4",
  "description": "Expresses unintentional actions or actions with regrettable outcomes; 'to end up doing', 'to accidentally do'.",
  "formation": "Verb-te form + しまう",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- 〜てしまう（後悔・完了）\n\n### Meaning and function\n- End up doing something, often unintentionally or with regret\n- Do something completely/entirely; completion beyond expectation (neutral or with emotional coloring)\n- Can predict an undesirable result if things continue as they are (warning/inevitability)\n\n### Form and templates\n- V-て + しまう（non-past: general statement/prediction/plan-less inevitability）\n- V-て + しまった（past: completed result; often regret or “it ended up happening”）\n- V-て + しまいます／しまいました（polite）\n- V-て + しまって（連用形 for linking causes, apologies, explanations）\n- Colloquial contractions (casual speech only; same meaning):\n  - 〜てしまう → 〜ちゃう\n  - 〜てしまった → 〜ちゃった\n  - 〜でしまう → 〜じゃう\n  - 〜でしまった → 〜じゃった\n- Conjugation notes\n  - しまう is a 五段 verb: しまう／しまいます／しまった／しまわない, etc. Negative forms exist but are uncommon with the “regret/unintentional” meaning.\n- Particle/ordering\n  - Attach しまう directly to the main verb’s て-form. Use 〜でしまう when the て-form is in 〜で.\n\n### Usage notes and constraints\n- Two core nuances:\n  - Unintentional/regrettable action or outcome (often with a slightly apologetic tone)\n  - Full completion/exhaustiveness (may be neutral, positive, or negative depending on context)\n- Register\n  - 〜てしまう/〜てしまった: neutral/plain\n  - 〜てしまいます/〜てしまいました: polite\n  - 〜ちゃう/〜ちゃった/〜じゃう/〜じゃった: casual; avoid in formal writing or speeches. 〜ちゃいます appears in casual–polite conversation but is less formal than 〜てしまいます.\n- Co-occurring adverbs\n  - Unintentionality: つい, うっかり, いつのまにか\n  - Completion/emphasis: もう, すっかり, とうとう, やっと\n- Scope/semantics\n  - Describes single, completed events rather than habits.\n  - Can be used for actions by the speaker or others; about others it can sound sympathetic or, depending on tone, mildly critical.\n  - Can combine with the passive to highlight an adverse effect on the subject (misfortune nuance).\n  - Often used in warnings/predictions with conditional frames (objective inevitability).\n- Orthography\n  - Auxiliary しまう is usually written in kana. Avoid 仕舞う when it is the auxiliary (仕舞う is typically the independent verb “to put away”).\n  - Contractions ちゃう／じゃう are written in kana.\n\n### Common mistakes (optional, only if relevant)\n- Using 〜ないでしまう to mean “end up not doing.” Prefer 〜ずじまい or 〜ないまま for “ended up not doing,” and 〜ずに済む for “managed to avoid doing.”\n- Misattaching to the ます-stem or dictionary form; it must follow the て-form.\n- Using casual contractions (ちゃう／じゃう) in formal contexts.\n- Using ちゃう after a 〜で て-form; after 〜で use じゃう.\n- Overusing 〜てしまう where simple past is enough, unintentionally adding a regretful tone.\n\n### Related grammar (optional, only if relevant)\n- V(ます)-終わる／V(ます)-終える: “finish doing” (pure completion; lacks the “oops/regret” nuance of 〜てしまう).\n- 〜てある: resultant state due to someone’s intentional action; focuses on the state, not the speaker’s regret.\n- 〜ずじまい: “ended up not doing (after all)”; the negative-side counterpart to the “end up” idea.\n- 〜ことになる: “it turns out/ends up that ...” as a circumstantial result; more objective, not inherently completive or regretful.\n- 〜ずに済む: “manage to avoid doing”; contrasts with the unwanted/inevitable feel of 〜てしまう.",
  "examples": [
    {
      "jp": "つい寝過ごしてしまった。",
      "en": "I ended up oversleeping."
    },
    {
      "jp": "うっかり名前を呼び間違えてしまって、すみません。",
      "en": "I'm sorry; I carelessly called you by the wrong name."
    },
    {
      "jp": "もう宿題は全部終わってしまいました。",
      "en": "I've already finished all the homework."
    },
    {
      "jp": "このままだと、バスに乗り遅れてしまいますよ。",
      "en": "At this rate, you'll end up missing the bus."
    },
    {
      "jp": "財布を盗まれてしまった。",
      "en": "My wallet got stolen."
    },
    {
      "jp": "雨に降られてしまって、靴がびしょびしょになりました。",
      "en": "I got caught in the rain and my shoes ended up soaking wet."
    },
    {
      "jp": "いつのまにか、コーヒーを全部飲んじゃった。",
      "en": "Before I knew it, I drank all the coffee."
    },
    {
      "jp": "大事なデータを消してしまわないように、こまめに保存します。",
      "en": "I save frequently so I don't end up deleting important data."
    },
    {
      "jp": "それ、今開けちゃってもいい？",
      "en": "Is it okay if I go ahead and open it now?"
    },
    {
      "jp": "昨夜、ケーキを全部食べちゃったの？",
      "en": "Did you end up eating all the cake last night?"
    },
    {
      "jp": "すっかり片づいてしまって、部屋が広く見える。",
      "en": "It's been completely tidied up, so the room looks spacious."
    },
    {
      "jp": "こんなに遅くまで起きていたら、明日倒れてしまうよ。",
      "en": "If you stay up this late, you'll end up collapsing tomorrow."
    },
    {
      "jp": "とうとう交渉がまとまってしまいましたね。",
      "en": "The negotiations have finally wrapped up, haven't they?"
    },
    {
      "jp": "言ってはいけないことを、思わず言ってしまった。",
      "en": "I unintentionally said something I shouldn't have."
    },
    {
      "jp": "彼に秘密を知られてしまって、気まずい。",
      "en": "He ended up finding out my secret, and it's awkward."
    },
    {
      "jp": "やっとレポートを書き終わってしまいました。",
      "en": "I finally finished writing the report."
    },
    {
      "jp": "この箱、捨ててしまってもいいですか。",
      "en": "Is it okay if I just throw this box away?"
    },
    {
      "jp": "そんなに押すと、壊れちゃうよ。",
      "en": "If you push it that hard, it'll end up breaking."
    },
    {
      "jp": "私、悲しい映画だとすぐ泣いちゃいます。",
      "en": "When it's a sad movie, I end up crying right away."
    },
    {
      "jp": "お酒は、あるとつい飲んじゃいますね。",
      "en": "If there's alcohol around, I tend to end up drinking it."
    }
  ],
  "negativeExamples": [
    {
      "jp": "靴を下駄箱にしまう。",
      "en": "I put the shoes in the shoe cabinet."
    },
    {
      "jp": "この箱はしまう場所がない。",
      "en": "There's nowhere to put this box away."
    },
    {
      "jp": "本をしまったあとで散歩に出た。",
      "en": "After I put the book away, I went out for a walk."
    },
    {
      "jp": "しまった、財布を会社に置いてきた。",
      "en": "Darn it, I left my wallet at the office."
    },
    {
      "jp": "問題はこれでしまいだ。",
      "en": "That's the end of the matter."
    },
    {
      "jp": "彼は古い写真をしまい込んだ。",
      "en": "He tucked away the old photos."
    },
    {
      "jp": "本はもう読み終えた。",
      "en": "I've already finished reading the book."
    },
    {
      "jp": "行かずじまいで帰った。",
      "en": "I ended up not going and went home."
    },
    {
      "jp": "先生は「〜てしまう」という表現を説明した。",
      "en": "The teacher explained the expression '〜te shimau'."
    },
    {
      "jp": "すっかり片づいたね。",
      "en": "It's all tidied up, isn't it?"
    }
  ]
}