{
  "id": "n4.verb-te-itadakemasen-ka",
  "level": "N4",
  "description": "A polite request; 'Could you please...', 'Would you mind...'",
  "formation": "Verb-て form + いただけませんか",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- 〜ていただけませんか（丁寧な依頼）\n\n### Meaning and function\n- A polite, humble request meaning “Would you be able to… (for me/us)?” or “Would you mind …ing?” It frames the action as a favor to the speaker/in-group.\n\n### Form and templates\n- Core\n  - V-て + いただけませんか\n- Common variants (softness/formality)\n  - V-て + いただけますか（やや直接的）\n  - V-て + いただけないでしょうか／いただけませんでしょうか（さらに丁寧・婉曲、ビジネス向け）\n  - Negative request: V-ないで + いただけませんか（「〜しないでいただけませんか」）\n- Participants and particles\n  - [依頼する相手（行為者）に] + V-て + いただけませんか（行為者を明示したいときは「に」で示す）\n  - 目的語・場所などは通常どおりの格助詞（を・に・へ・で・と・から など）\n  - 受益者（基本は話し手）は通常明示しない（「私に」を付けない）\n- Conjugation/inflection notes\n  - いただく（humble of もらう）→ potential いただける → polite negative question いただけませんか\n  - Casual-soft variant exists: V-て + いただけない？（親しい間柄のみ）\n\n### Usage notes and constraints\n- Register/naturalness\n  - Polite/humble request; suitable with superiors, customers, or strangers. Very common in service and business contexts.\n- Pragmatics/semantics\n  - Presents the action as a favor benefiting the speaker/in-group. Do not use it to ask permission for your own action; use 〜させていただけませんか for that.\n  - When specifying a third-party doer, mark them with に（例：Aさんに〜ていただけませんか）; the favor still targets the speaker’s side.\n- Softness scale\n  - 〜てください（最も直接） < 〜ていただけますか < 〜ていただけませんか < 〜ていただけないでしょうか／〜ていただけませんでしょうか（最も婉曲）\n  - Negative-interrogative 〜ませんか sounds softer/more tentative than 〜ますか.\n- Orthography\n  - As an auxiliary after V-て, いただく is typically written in hiragana (いただく). The kanji 頂く appears but is less preferred in this auxiliary use.\n- Notes on very formal variants\n  - 〜ていただけますでしょうか／〜ていただけませんでしょうか is frequent in business writing/speech; some style guides call it redundant, but it is widely accepted in formal contexts.\n- Negative requests\n  - V-ないで + いただけませんか is a polite “please don’t …”. In signage/formal notices, fixed phrases like ご遠慮ください／ご遠慮いただけますか are also common.\n\n### Common mistakes (optional, only if relevant)\n- Mixing patterns: avoid V-てくださっていただけませんか (double-benefactive).\n- Adding 私に to mark the beneficiary: it’s implicit and sounds unnatural.\n- Using 〜ていただけませんか to ask permission for your own action; use 〜させていただけませんか instead.\n- Overusing the kanji 頂く in this auxiliary function.\n\n### Related grammar (optional, only if relevant)\n- 〜てもらえますか：Everyday polite “Could you…?”; less formal than 〜ていただけませんか; not humble.\n- 〜てくれませんか：Polite but more direct; for equals/subordinates; avoid with superiors/strangers.\n- 〜てください：Polite imperative; directive and stronger; often too blunt as a request.\n- 〜させていただけませんか：Polite request for permission to do something yourself.",
  "examples": [
    {
      "jp": "恐れ入りますが、こちらの書類を今日中に送っていただけませんか。",
      "en": "Excuse me, would you be able to send this document by the end of today?"
    },
    {
      "jp": "会議の開始時刻をもう一度確認していただけますか。",
      "en": "Could you check the meeting start time once more?"
    },
    {
      "jp": "駅までの行き方を簡単に教えていただけないでしょうか。",
      "en": "Would you mind briefly telling me how to get to the station?"
    },
    {
      "jp": "少々待って頂けませんでしょうか。",
      "en": "Would you mind waiting a moment?"
    },
    {
      "jp": "お手数ですが、明日の打ち合わせを午後に変更していただけませんか。",
      "en": "Sorry for the trouble, but could you move tomorrow’s meeting to the afternoon?"
    },
    {
      "jp": "営業部の田中さんに見積書を作成していただけますか。",
      "en": "Could you have Mr. Tanaka in Sales prepare the estimate?"
    },
    {
      "jp": "このファイル、削除しないでいただけませんか。",
      "en": "Could you please not delete this file?"
    },
    {
      "jp": "先日お送りした見積について、今週中に確認していただけますでしょうか。",
      "en": "Regarding the estimate I sent the other day, could you check it within this week?"
    },
    {
      "jp": "今だけ静かにしていただけませんか。",
      "en": "Could you please be quiet just for now?"
    },
    {
      "jp": "こちらの資料はコピーを取らないでいただけませんか。",
      "en": "Could you please not make copies of these materials?"
    },
    {
      "jp": "先ほどの説明、もう少しゆっくり繰り返していただけませんか。",
      "en": "Could you repeat the explanation a bit more slowly?"
    },
    {
      "jp": "受付の方に来客を会議室へ案内していただけませんか。",
      "en": "Could you ask the receptionist to guide the visitor to the meeting room?"
    },
    {
      "jp": "ねえ、昨日の写真、後で送っていただけない？",
      "en": "Hey, could you send me the photos from yesterday later?"
    },
    {
      "jp": "課長にこの案を検討していただけませんか。",
      "en": "Could you have the section chief consider this proposal?"
    },
    {
      "jp": "できれば、宛先を英語で書いていただけませんか。",
      "en": "If possible, could you write the address in English?"
    },
    {
      "jp": "会費、来週までに振り込んでいただけない？",
      "en": "Could you transfer the membership fee by next week?"
    },
    {
      "jp": "急ぎですが、今すぐ確認していただけませんでしょうか。",
      "en": "It’s urgent—could you check it right away?"
    },
    {
      "jp": "明日の講師の方に、開始前に機材をテストしていただけますでしょうか。",
      "en": "Could you have tomorrow’s instructor test the equipment before the session starts?"
    },
    {
      "jp": "この話は、しばらく他の人に話さないでいただけませんか。",
      "en": "Could you not tell others about this for a while?"
    },
    {
      "jp": "すみません、もう少し音量を小さくしていただけますか。",
      "en": "Excuse me, could you turn the volume down a little more?"
    }
  ],
  "negativeExamples": [
    {
      "jp": "こちらの席に座ってもらえますか。",
      "en": "Could you sit here?"
    },
    {
      "jp": "資料を送ってくれませんか。",
      "en": "Could you send the documents?"
    },
    {
      "jp": "明日の見学、参加させていただけませんか。",
      "en": "May I participate in tomorrow’s tour?"
    },
    {
      "jp": "お水をいただけますか。",
      "en": "May I have some water?"
    },
    {
      "jp": "お時間を少々いただけますでしょうか。",
      "en": "May I take a moment of your time?"
    },
    {
      "jp": "「参加していただけませんか」と書かれた案内状が届きました。",
      "en": "An invitation that said “Would you please participate?” arrived."
    },
    {
      "jp": "先ほどの件は課長に確認していただいたそうです。",
      "en": "I heard the section chief checked the matter for us earlier."
    },
    {
      "jp": "会議室では飲食をご遠慮ください。",
      "en": "Please refrain from eating or drinking in the conference room."
    },
    {
      "jp": "今の説明、もう一度お願いできますか。",
      "en": "Could I ask you to explain that once more?"
    },
    {
      "jp": "私どもから確認のご連絡を差し上げてもよろしいでしょうか。",
      "en": "Would it be alright if we contacted you to confirm?"
    }
  ]
}