{
  "id": "n4.verb-te-moraemasen-ka",
  "level": "N4",
  "description": "A polite way to ask for a favor or request someone to do something.",
  "formation": "Verb-て form + もらえませんか",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- 〜てもらえませんか\n\n### Meaning and function\n- A polite, soft request meaning “Could you (do X) for me?” It frames the action as a favor the speaker would receive from the listener.\n\n### Form and templates\n- Core\n  - V(て/で) + もらえませんか\n    - Verb in て/で-form + potential negative polite of もらう, with question か\n- Politeness/softness variants\n  - V(て/で) + もらえますか: neutral, a bit more direct than the negative-question form\n  - V(て/で) + もらえない？: casual\n  - V(て/で) + いただけませんか: more polite/formal (business/speaking to superiors)\n  - V(て/で) + いただけないでしょうか／いただけますでしょうか: very polite, extra-softening\n- Negative request (asking someone not to do X)\n  - V(ないで) + いただけませんか／くれませんか is preferred\n  - V(ないで) + もらえませんか also occurs but is less common/natural\n- Participants and particles\n  - The doer of the action (if specified and not the listener) is marked with に: N(人) + に + V(て/で) + もらえませんか\n  - The beneficiary is typically the speaker (or the speaker’s in-group) and is usually omitted\n  - Other arguments (objects, time, place, etc.) take their normal particles and precede the verb as usual\n- Conjugation notes\n  - もらう → potential もらえる → polite negative もらえません → question か\n  - Do not use past; this is a request formula\n  - て-form assimilation (て/で) follows regular phonological rules\n\n### Usage notes and constraints\n- Register/naturalness\n  - Polite and common in everyday requests to people outside one’s in-group; softer than 〜てください\n  - For formal/business or when addressing superiors, prefer 〜ていただけませんか (or softer variants with でしょうか)\n  - In casual speech, 〜てもらえない？ or 〜てくれない？ is common\n- Semantic scope\n  - Used to request an action the listener (or specified person) can volitionally perform\n  - Not for asking permission for the speaker’s own action; use 〜てもいいですか for permission\n- Nuance vs. 〜てくれませんか\n  - 〜てもらえませんか presents the request from the receiver’s side and sounds a bit more self-effacing/indirect\n  - 〜てくれませんか focuses more on the doer and can feel slightly more direct\n- Softening strategies\n  - Precede with set phrases like すみませんが／恐れ入りますが to soften\n  - Ending with 〜でしょうか further softens\n- Orthography\n  - もらう is usually written in kana (もらう); 貰う also exists but is less common in modern style\n  - いただく is typically kana when used as an auxiliary (〜ていただく)\n\n### Common mistakes (optional)\n- Confusing request with permission: using 〜てもいいですか when you want the listener to do it (use 〜てもらえませんか)\n- Using 〜てもらいますか as a request; it sounds pushy or odd. Use the potential negative polite question (〜てもらえませんか)\n- Marking the doer with を instead of に when specifying a third person\n- Using with non-volitional/uncontrollable events (sounds unnatural)\n- Overusing 〜てもらえませんか in very formal settings where 〜ていただけませんか is expected\n\n### Related grammar (optional)\n- 〜てください: direct “please do,” less soft than 〜てもらえませんか\n- 〜てくれませんか／〜てくれない？: similar request; a bit more direct than 〜てもらえませんか (casual with 〜ない？)\n- 〜ていただけませんか／〜ていただけないでしょうか: more polite/honorific, preferred in business or to superiors\n- 〜てもいいですか: asks permission for the speaker’s own action, not a request for the listener to act\n- 〜ないでください／〜ないでいただけませんか: “please don’t ~,” negative request forms",
  "examples": [
    {
      "jp": "すみませんが、この書類を今日中に確認して貰えませんか。",
      "en": "Excuse me, could you please check this document by the end of today?"
    },
    {
      "jp": "その箱、ちょっと上に運んでもらえますか。",
      "en": "Could you move that box up a bit?"
    },
    {
      "jp": "明日の朝七時に起こしてもらえない？",
      "en": "Could you wake me up at seven tomorrow morning?"
    },
    {
      "jp": "恐れ入りますが、こちらの住所に送り先を変更していただけませんか。",
      "en": "I’m sorry, but could you change the shipping address to this address?"
    },
    {
      "jp": "お手数ですが、先日の件について、担当者に折り返しご連絡いただけますでしょうか。",
      "en": "Sorry for the trouble, but could the person in charge call me back about the matter from the other day?"
    },
    {
      "jp": "会議中なので、電話は鳴らさないでいただけませんか。",
      "en": "We’re in a meeting, so could you please not let the phone ring?"
    },
    {
      "jp": "その話、今はしないでくれませんか。",
      "en": "Could we not talk about that right now?"
    },
    {
      "jp": "うるさいので、ドアを静かに閉めてもらえますか。",
      "en": "It’s noisy, so could you close the door quietly?"
    },
    {
      "jp": "すみません、駅までの道を丁寧に教えてもらえませんか。",
      "en": "Excuse me, could you kindly tell me the way to the station?"
    },
    {
      "jp": "こちらの名刺を、隣の席の方に渡してもらえない？",
      "en": "Could you pass this business card to the person in the next seat?"
    },
    {
      "jp": "もし可能でしたら、資料をPDFで送っていただけないでしょうか。",
      "en": "If possible, could you send the materials as a PDF?"
    },
    {
      "jp": "今日の会議、部長に同席してもらえませんか。",
      "en": "For today’s meeting, could you have the manager sit in as well?"
    },
    {
      "jp": "すみませんが、コピー機の紙を補充してもらえませんか。",
      "en": "Sorry, could you refill the paper in the copy machine?"
    },
    {
      "jp": "もう少しゆっくり話してもらえますか。",
      "en": "Could you speak a little more slowly?"
    },
    {
      "jp": "その写真、SNSに上げないでもらえませんか。",
      "en": "Could you not post that photo on social media?"
    },
    {
      "jp": "管理人さん、隣の部屋の方に少し静かにしていただけませんか。",
      "en": "Manager, could you ask the person in the next room to keep it a little quieter?"
    },
    {
      "jp": "こちらの案内図、もう一部印刷してもらえませんか。",
      "en": "Could you print one more copy of this map?"
    },
    {
      "jp": "そのリンク、もう一度貼ってもらえない？",
      "en": "Could you paste that link again?"
    },
    {
      "jp": "バスの中では、通路に荷物を置かないでいただけませんか。",
      "en": "On the bus, could you please not place your luggage in the aisle?"
    },
    {
      "jp": "恐れ入ります、予約の名前を確認していただけますでしょうか。",
      "en": "Pardon me, could you check the name on the reservation?"
    }
  ],
  "negativeExamples": [
    {
      "jp": "ここで写真を撮ってもいいですか。",
      "en": "Is it okay if I take photos here?"
    },
    {
      "jp": "この資料、明日までに送ってくれませんか。",
      "en": "Could you send this document by tomorrow?"
    },
    {
      "jp": "すみません、そのペンをもらえますか。",
      "en": "Excuse me, may I have that pen?"
    },
    {
      "jp": "手伝ってもらえる？",
      "en": "Could you help me?"
    },
    {
      "jp": "静かにしてください。",
      "en": "Please be quiet."
    },
    {
      "jp": "駅まで送ってもらったので助かりました。",
      "en": "I got a ride to the station, so that helped."
    },
    {
      "jp": "担当者に折り返しの連絡をもらえますか。",
      "en": "Could I get a return call from the person in charge?"
    },
    {
      "jp": "「部屋を片づけていただけませんか」というメモが机にあった。",
      "en": "There was a note on the desk that said, “Could you tidy up the room?”"
    },
    {
      "jp": "会議室を使ってもいいでしょうか。",
      "en": "Would it be all right if I used the meeting room?"
    },
    {
      "jp": "念のため、見積書を送っていただきたいのですが。",
      "en": "If possible, I’d like you to send the estimate."
    }
  ]
}