{
  "id": "n4.verb-nai-koto-ga-aru",
  "level": "N4",
  "description": "Expresses that something doesn't always happen or there are occasions when it doesn't happen.",
  "formation": "Verb-negative form + ことがある",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- 〜ないことがある\n\n### Meaning and function\n- States that something does not always happen; there are occasions/cases when it doesn’t occur. Equivalent to “sometimes not” or “it’s not always the case that …”.\n\n### Form and templates\n- V-ない + ことがある\n  - Plain negative non-past verb + ことがある\n- Politeness/tense on ある:\n  - ある (plain), あります (polite), あった／ありました (past)\n  - Important: using ありません negates “there are,” yielding “there are no times when not” (= it always happens), which is a different meaning.\n- Optional elements and variants:\n  - N(は) + V-ない + ことがある … to set the topic/scope (person, time, situation)\n  - こともある adds “also,” highlighting that both occurrence and non-occurrence happen\n  - Frequency adverbs (たまに／ときどき／まれに) can be added to indicate how often\n- Conjugation notes:\n  - The verb before こと stays in plain -ない form, even in polite speech (do not use V-ません before こと).\n  - V-なかった + ことがある can refer to having had such an instance in the past; V-ない + ことがあった/ありました frames “there were times when not” in past narration.\n\n### Usage notes and constraints\n- Register: Natural in both speech and writing; plain or polite depending on ある.\n- Typical use: General habits, tendencies, or systems that usually happen but have exceptions; indicates inconsistency or occasional failure to occur.\n- Scope: Often paired with a topic (〜は) or a time frame to define “within what situation there are times when not.”\n- Nuance:\n  - ことがある (affirmative main verb) signals existence of “instances,” while the verb inside is negative, giving “instances of not doing/happening.”\n  - こともある emphasizes partialness (“there are also times when not”).\n- Contrast with close forms:\n  - 〜ないときがある: more concrete, time-specific feel (“there are times/days when not”); 〜ないことがある is slightly more abstract (“cases/occasions”).\n  - For higher frequency (“often doesn’t happen”), use 〜ないことが多い rather than adverbs like よく with 〜ないことがある.\n- Orthography: こと is commonly in kana; 事 may appear in formal writing.\n\n### Common mistakes (optional, only if relevant)\n- Using V-ません + ことがある (incorrect). Keep the verb in plain -ない; put politeness on ある (あります).\n- Saying V-ないことがありません when you mean “sometimes not.” That means “there are no times when not” (= it always happens).\n- Overusing with one-off, specific events; this pattern implies recurring possibilities, not a single scheduled instance.\n- Confusing with V-たことがない (“have never done”), which expresses zero experience, not “sometimes not.”\n\n### Related grammar (optional, only if relevant)\n- V-る + ことがある: Sometimes do; positive counterpart.\n- V-ないこともある: There are also times when not; explicitly contrasts with times when it does happen.\n- V-ないときがある: Times when not; more time-specific than the abstract こと.\n- V-ないことが多い: It often doesn’t happen; stronger frequency than 〜ないことがある.\n- V-たことがない: Have never done; zero-experience, not occasional non-occurrence.",
  "examples": [
    {
      "jp": "たまに電車が来ないことがある。",
      "en": "Sometimes the train doesn’t come."
    },
    {
      "jp": "このアプリは通知が届かないことがあります。",
      "en": "With this app, notifications sometimes don’t arrive."
    },
    {
      "jp": "雨の日は、タクシーがつかまらないこともあります。",
      "en": "On rainy days, there are also times when you can’t catch a taxi."
    },
    {
      "jp": "会議が長引くと、昼休みが取れないことがありますか。",
      "en": "When meetings run long, are there times you can’t take a lunch break?"
    },
    {
      "jp": "以前、サーバーに接続できなかったことがある。",
      "en": "I’ve had times when I couldn’t connect to the server."
    },
    {
      "jp": "私も、ときどき約束の時間に間に合わないことがある。",
      "en": "I also sometimes don’t make it on time for appointments."
    },
    {
      "jp": "この道は、まれに車が通らないことがある。",
      "en": "On this road, there are rare times when no cars pass."
    },
    {
      "jp": "子どもは気分次第で挨拶をしないことがある。",
      "en": "Kids sometimes don’t say hello, depending on their mood."
    },
    {
      "jp": "去年の夏、夜は涼しくてエアコンをつけないことがあった。",
      "en": "Last summer, the nights were cool and there were times we didn’t turn on the AC."
    },
    {
      "jp": "最近、通知音が鳴らないことがありますか。",
      "en": "These days, are there times when the notification sound doesn’t ring?"
    },
    {
      "jp": "このプリンター、紙をうまく吸い込まないことがある？",
      "en": "Does this printer sometimes fail to feed paper properly?"
    },
    {
      "jp": "混んでいる店だと、注文した料理が出てこないことがある。",
      "en": "At crowded restaurants, there are times when the dishes you ordered don’t come out."
    },
    {
      "jp": "電波が弱い場所では、動画が再生されないこともある。",
      "en": "In places with a weak signal, videos sometimes don’t play."
    },
    {
      "jp": "彼はいつも明るいが、疲れていると冗談を言わないことがある。",
      "en": "He’s usually cheerful, but when he’s tired, there are times he doesn’t joke."
    },
    {
      "jp": "受付は、昼休み中は電話に出ないことがあります。",
      "en": "At the reception desk, during the lunch break there are times they don’t answer the phone."
    },
    {
      "jp": "店によっては、クレジットカードが使えないことがあった。",
      "en": "Depending on the store, there were times when credit cards couldn’t be used."
    },
    {
      "jp": "私は、忙しすぎて朝ごはんを食べないことがありました。",
      "en": "I was so busy that there were times I didn’t eat breakfast."
    },
    {
      "jp": "締め切りに間に合わなかったことがあります。",
      "en": "I’ve had times when I didn’t make the deadline."
    },
    {
      "jp": "約束していても、相手が現れないことがある。",
      "en": "Even when we’ve made plans, there are times the other person doesn’t show up."
    },
    {
      "jp": "説明書を読んでも、うまく組み立てられないことがある。",
      "en": "Even after reading the manual, there are times I can’t assemble it well."
    }
  ],
  "negativeExamples": [
    {
      "jp": "時々雨が降ることがある。",
      "en": "Sometimes it rains."
    },
    {
      "jp": "電車が来ないときがある。",
      "en": "There are times when the train doesn’t come."
    },
    {
      "jp": "北海道に行ったことがある。",
      "en": "I’ve been to Hokkaido."
    },
    {
      "jp": "遅れないことが条件だ。",
      "en": "Not being late is a condition."
    },
    {
      "jp": "行かないことがありません。",
      "en": "There are no times when I don’t go."
    },
    {
      "jp": "そんなことがあるわけがない。",
      "en": "There’s no way such a thing can happen."
    },
    {
      "jp": "雨が降らないことも多い。",
      "en": "There are also many times when it doesn’t rain."
    },
    {
      "jp": "忘れないことを心がけている。",
      "en": "I make a point of not forgetting."
    },
    {
      "jp": "この機械には危ないことがある。",
      "en": "This machine can be dangerous at times."
    },
    {
      "jp": "行かないことにした。",
      "en": "I decided not to go."
    }
  ]
}