{
  "id": "n4.verb-te-kudasaimasen-ka",
  "level": "N4",
  "description": "Polite request for asking someone for a favor.",
  "formation": "Verb in て-form + くださいませんか",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- 〜てくださいませんか\n\n### Meaning and function\n- A very polite, indirect request asking someone to do something; roughly “Would you please …?” or “Could you …, please?”\n\n### Form and templates\n- Core:\n  - V(て) + くださいませんか\n- Negative request (“Please don’t …”):\n  - V(ないで) + くださいませんか\n- Softer/more deferential variants:\n  - V(て) + くださいますか (polite, more direct than the negative-question form)\n  - V(て) + くださいませんでしょうか (extra soft/formal)\n- Optional softeners placed before the request (common in business and service contexts):\n  - どうか, ちょっと, 少々, すみませんが／恐縮ですが／恐れ入りますが など\n- Particle use:\n  - Case particles (を／に／で／へ／と など) appear as required by the verb before the て-form; the request attaches to the verb phrase in て-form.\n- Conjugation notes:\n  - The main verb must be in plain て-form (not ます-stem). Politeness is carried by くださいません.\n  - くださいません is the polite negative of くださる used in a question to soften the request; it does not make the meaning negative.\n  - Past polite negative (くださいませんでしたか) is generally not used to make a request; it sounds like reproach or confirming non-compliance.\n\n### Usage notes and constraints\n- Register/naturalness:\n  - Formal–polite; softer and more deferential than 〜てください. Common with strangers, customer service, public announcements, or formal emails. In casual settings it can sound too stiff or distant.\n  - In many business contexts today, 〜ていただけませんか or 〜ていただけますでしょうか is even more common/natural for deference.\n- Semantic scope:\n  - Requests the listener to perform the action (benefactive direction toward the speaker or speaker’s side).\n  - For asking permission to do something yourself, use 〜てもいいですか rather than this pattern.\n- Contrast within the family:\n  - 〜くださいますか is polite but more direct; 〜くださいませんか is more indirect/softer.\n- Orthographic notes:\n  - ください (as an auxiliary after V(て)) is usually written in kana. 下さい may appear in signs or older texts but kana is preferred in modern usage.\n- Frequency:\n  - Perfectly acceptable, but in everyday spoken polite Japanese many speakers favor 〜てもらえますか／〜ていただけますか for naturalness.\n\n### Common mistakes (optional, only if relevant)\n- Using V(ます) + て + くださいませんか (incorrect). The verb must be in plain て-form.\n- Trying to attach it to adjectives or nouns; it only follows verbs in て-form.\n- Using くださいませんでしたか to make a new request (sounds like criticism or confirming the past).\n- Using 〜てくれませんか with superiors or in formal settings (too casual/overly direct compared with 〜てくださいませんか).\n\n### Related grammar (optional, only if relevant)\n- 〜てください: Polite but more direct; standard request.\n- 〜てくれませんか／〜てくれない？: Casual–polite/casual, friendly request to equals or close people.\n- 〜てもらえませんか: Polite, natural in everyday speech; focuses on the speaker “receiving” the favor.\n- 〜ていただけませんか／〜ていただけますでしょうか: More honorific/humble; very common and safest in business/official contexts.\n- 〜てもいいですか: Asking permission for one’s own action, not requesting the listener to do it.",
  "examples": [
    {
      "jp": "すみませんが、窓を少し開けてくださいませんか。",
      "en": "Excuse me, would you please open the window a little?"
    },
    {
      "jp": "恐れ入りますが、こちらの用紙にお名前とご連絡先を記入してくださいますか。",
      "en": "Pardon me, would you write your name and contact information on this form?"
    },
    {
      "jp": "どうか席を譲ってくださいませんでしょうか。",
      "en": "Could you please give up your seat?"
    },
    {
      "jp": "少々お手数ですが、荷物を玄関まで運んでくださいませんか。",
      "en": "Sorry for the trouble, would you carry the luggage to the entrance?"
    },
    {
      "jp": "ちょっと静かにしてくださいますか。",
      "en": "Could you please be a little quiet?"
    },
    {
      "jp": "すみませんが、その書類を今すぐ送ってくださいませんか。",
      "en": "Excuse me, would you please send those documents right away?"
    },
    {
      "jp": "申し訳ありませんが、ここでは写真を撮らないでくださいませんか。",
      "en": "I’m sorry, but could you please not take photos here?"
    },
    {
      "jp": "大変恐縮ですが、明日の予定を私にメールで知らせてくださいませんでしょうか。",
      "en": "I’m terribly sorry to trouble you, but would you please email me tomorrow’s schedule?"
    },
    {
      "jp": "先ほどお伝えした件について、確認してくださいますか。",
      "en": "Regarding what I told you earlier, could you please check it?"
    },
    {
      "jp": "駅に着いたら、電話をかけてくださいませんか。",
      "en": "When you arrive at the station, would you please give me a call?"
    },
    {
      "jp": "大変恐れ入りますが、列にお並びになってくださいませんか。",
      "en": "We sincerely apologize, but would you please line up?"
    },
    {
      "jp": "このフォームの必須項目に漏れがないか、チェックしてくださいますか。",
      "en": "Would you please check whether there are any omissions in the required fields on this form?"
    },
    {
      "jp": "大声で話さないでくださいませんか。",
      "en": "Could you please not speak loudly?"
    },
    {
      "jp": "会議室のエアコンを消してくださいますか。",
      "en": "Would you please turn off the air conditioner in the meeting room?"
    },
    {
      "jp": "どうか本日は早めにお帰りになってくださいませんか。",
      "en": "Would you please head home early today?"
    },
    {
      "jp": "今朝届いた荷物を、部署の棚に戻してくださいますか。",
      "en": "Would you please put the package that arrived this morning back on the department’s shelf?"
    },
    {
      "jp": "こちらの順番を守ってくださいませんか。",
      "en": "Would you please follow the order here?"
    },
    {
      "jp": "ごみは分別して捨ててくださいませんか。",
      "en": "Would you please sort the trash and throw it away?"
    },
    {
      "jp": "その話は、ここでは触れないでくださいませんか。",
      "en": "Would you please not bring up that topic here?"
    },
    {
      "jp": "お忙しいところすみませんが、提出期限を延長してくださいますか。",
      "en": "Sorry to bother you while you’re busy, but would you please extend the submission deadline?"
    }
  ],
  "negativeExamples": [
    {
      "jp": "昨日のメール、読んでくださいましたか。",
      "en": "Did you read yesterday’s email?"
    },
    {
      "jp": "窓を開けてくださいませんでしたか。",
      "en": "Didn’t you open the window?"
    },
    {
      "jp": "静かにしてくれませんか。",
      "en": "Could you be quiet?"
    },
    {
      "jp": "静かにしてもらえませんか。",
      "en": "Could I ask you to be quiet?"
    },
    {
      "jp": "静かにしていただけますでしょうか。",
      "en": "Would you be able to keep your voice down?"
    },
    {
      "jp": "どうかご協力ください。",
      "en": "Please cooperate."
    },
    {
      "jp": "資料をご確認ください。",
      "en": "Please check the documents."
    },
    {
      "jp": "写真を撮らないでください。",
      "en": "Please do not take photos."
    },
    {
      "jp": "ボタンを押してくださらないでしょうか。",
      "en": "Would you mind pressing the button?"
    },
    {
      "jp": "こちらにお名前のご記入をお願いできますか。",
      "en": "Could I ask you to fill in your name here?"
    }
  ]
}