{
  "id": "n4.verb-ru-tokoro",
  "level": "N4",
  "description": "Expresses the state or moment when an action is about to happen or is happening.",
  "formation": "Verb-dictionary form + ところ",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- Vる／Vている＋ところ\n\n### Meaning and function\n- Points to the exact time frame of an action:\n  - V(辞書形)ところ: just about to do (imminent future)\n  - V(ている)ところ: in the middle of doing (ongoing action)\n  - (Common alternation) V(た)ところ: just finished doing (immediate past)\n\n### Form and templates\n- Core templates\n  - V(辞書形)＋ところ(だ／です)\n  - V(ている)＋ところ(だ／です)\n  - [Alternation] V(た)＋ところ(だ／です)\n- Particle behavior\n  - ところ is a noun; it can take particles when linking another event:\n    - ところに／へ: at that very moment, something approaches/occurs toward the subject\n    - ところで: at that point, an event occurs in that setting\n    - ところを: the action/timing is the object of another action (e.g., being seen/caught)\n    - ところで (discourse marker “by the way”) is unrelated to this grammar\n- Optional/auxiliary elements\n  - Time/intensity adverbs often appear: 今、これから、まさに、ちょうど\n  - Past framing: 〜ところだった\n    - Vるところだった: was just about to (often implies it didn’t happen)\n    - Vているところだった: was in the middle of\n    - Vたところだった: had just done\n- Conjugation/inflection notes\n  - Politeness attaches to ところ: use だ／です／でした. The verb stays in dictionary/ている/た form (no ます before ところ)\n\n### Usage notes and constraints\n- Register/naturalness\n  - Neutral and common in conversation; use です for polite speech\n- Semantic scope\n  - V(辞書形)ところ indicates an imminent action (seconds/minutes). For plans or schedules, use つもり／予定 instead\n  - V(ている)ところ is for ongoing, durative actions that take time; it emphasizes “right now, in progress”\n  - V(た)ところ (alternation) means immediate completion; for broader “recently,” prefer Vたばかり\n- Verb-type constraints\n  - V(ている)ところ is unnatural with punctual/instantaneous or stative verbs (e.g., arrive, understand, exist) where no “in-progress” phase is felt\n- Orthography\n  - ところ is normally written in kana; 所 appears in formal writing but kana is standard for this grammar\n\n### Common mistakes (optional, only if relevant)\n- Putting ます before ところ (e.g., しますところ) instead of attaching です to ところ\n- Using V(る)ところ for non-imminent future plans; use つもり／予定\n- Using V(ている)ところ with stative or instantaneous verbs that lack a middle phase\n- Confusing this ところ with the conjunctions ところで (“by the way”) and ところが (“however”)\n- Using V(た)ところ when the meaning is “recently” rather than “just now”; use Vたばかり for the broader sense\n\n### Related grammar (optional, only if relevant)\n- V(る)前に: general “before,” not necessarily imminent; ところ is the exact moment before\n- 最中(に): “in the very middle of,” stronger non-interruption nuance than V(ている)ところ\n- V(た)ばかり: “(relatively) recently did,” broader than V(た)ところ’s “just now”\n- つもり／予定: intention/schedule, not the immediate timing that ところ marks\n- とき／あいだ: general time/while span; ところ pinpoints the moment/phase of the action",
  "examples": [
    {
      "jp": "今、出かけるところです。",
      "en": "I’m just about to head out now."
    },
    {
      "jp": "まさに会議を始めるところでしたが、停電になりました。",
      "en": "We were just about to start the meeting when there was a blackout."
    },
    {
      "jp": "ちょうど昼ご飯を食べているところだ。",
      "en": "I’m right in the middle of eating lunch."
    },
    {
      "jp": "今、お電話しているところですか。",
      "en": "Are you on the phone right now?"
    },
    {
      "jp": "ちょうど宿題を終えたところだ。",
      "en": "I just finished my homework."
    },
    {
      "jp": "ちょうど家を出るところに、電話がかかってきました。",
      "en": "Just as I was about to leave the house, the phone rang."
    },
    {
      "jp": "駅に着いたところへ、友だちに声をかけられた。",
      "en": "Just as I arrived at the station, a friend called out to me."
    },
    {
      "jp": "勉強しているところを母に写真を撮られた。",
      "en": "My mother took a photo of me right while I was studying."
    },
    {
      "jp": "作業を始めたところで、急用が入った。",
      "en": "We had just started the work when something urgent came up."
    },
    {
      "jp": "今は出発するところじゃない。",
      "en": "Now is not the time to set off."
    },
    {
      "jp": "ちょうど出発したところだったのに、忘れ物に気づいて引き返した。",
      "en": "I had just set out when I realized I’d forgotten something and turned back."
    },
    {
      "jp": "昨日は帰るところではなかったので、残業した。",
      "en": "It wasn’t the moment to go home yesterday, so I worked overtime."
    },
    {
      "jp": "今、会議をしているところではありませんか。",
      "en": "Aren’t you in the middle of a meeting now?"
    },
    {
      "jp": "危うく転ぶところだった。",
      "en": "I almost fell."
    },
    {
      "jp": "私がドアを開けたところに、猫が飛び出してきた。",
      "en": "Just as I opened the door, a cat jumped out."
    },
    {
      "jp": "店に入ったところで、財布を忘れたのに気づいた。",
      "en": "Right after I entered the store, I realized I had forgotten my wallet."
    },
    {
      "jp": "ただいま、担当者は別の来客に対応している所です。",
      "en": "At the moment, the person in charge is attending to another visitor."
    },
    {
      "jp": "これから走るところだから、あとで話そう。",
      "en": "I’m about to go for a run now, so let’s talk later."
    },
    {
      "jp": "ちょうど寝るところですか。",
      "en": "Are you just about to go to bed?"
    },
    {
      "jp": "さっきはちょうど運転しているところだったので、返信できませんでした。",
      "en": "A moment ago I was in the middle of driving, so I couldn’t reply."
    }
  ],
  "negativeExamples": [
    {
      "jp": "ところで、明日の打ち合わせは何時ですか。",
      "en": "By the way, what time is tomorrow’s meeting?"
    },
    {
      "jp": "静かなところに住んでいます。",
      "en": "I live in a quiet area."
    },
    {
      "jp": "このところ、体調があまり良くない。",
      "en": "These days, I haven’t been feeling very well."
    },
    {
      "jp": "さっき帰ったばかりです。",
      "en": "I just got home a little while ago."
    },
    {
      "jp": "食事の最中に電話が鳴った。",
      "en": "The phone rang in the middle of a meal."
    },
    {
      "jp": "明日は早く出発する予定です。",
      "en": "I’m scheduled to leave early tomorrow."
    },
    {
      "jp": "出かける前に、窓を閉めてください。",
      "en": "Please close the windows before going out."
    },
    {
      "jp": "今、会議しています。",
      "en": "I’m in a meeting now."
    },
    {
      "jp": "いくら謝ったところで、彼は許さないだろう。",
      "en": "No matter how much you apologize, he probably won’t forgive you."
    },
    {
      "jp": "東京の見どころを教えてください。",
      "en": "Please tell me the must-see spots in Tokyo."
    }
  ]
}