{
  "id": "n4.you-ni-naru",
  "level": "N4",
  "description": "Express a change in ability, situation or state; 'become able to', 'come to', 'begin to'.",
  "formation": "Verb-dictionary/potential form + ようになる",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- 〜ようになる（変化・能力）\n\n### Meaning and function\n- Expresses a change to a new state or habit: “come to (do),” “now (do).”\n- With potential form: “become able to (do).”\n- Negative: “come to not (do) / no longer (do).”\n- Resultant/arranged state with 〜ようになっている: “be set up/arranged so that …”\n\n### Form and templates\n- V(dict) + ようになる … change in habit/tendency (“come to do (regularly/as a rule)”)\n- V(potential) + ようになる … change in ability/possibility (“become able to …”)\n- V(ない) + ようになる … change to non-occurrence (“come to not … / stop …”)\n- Tense/politeness:\n  - 〜ようになった (past result), 〜ようになります (polite), 〜ようになっている (has become so and is now set up that …)\n- Common adverbs for gradual change: だんだん, 少しずつ, 次第に (more formal)\n- Potential formation notes:\n  - する → できる; 来る → 来られる（こられる）. In casual speech, ら抜き is heard (e.g., 来れる) but avoid in formal settings.\n  - With potential, the direct object is typically marked by が rather than を.\n- Optional alternative when potential is awkward/ambiguous: V(dict) + ことができる ようになる (more formal/heavy)\n- Do not use with adjectives/nouns; use い-adj(〜く)なる / な-adj(〜に)なる for “become ADJ/N.”\n\n### Usage notes and constraints\n- Register: neutral and very common in both spoken and written Japanese; polite or plain as needed.\n- Semantics:\n  - Focuses on a state change (ability, circumstances, habit). It suggests the result of factors beyond one’s direct volition.\n  - Not for a single, punctual start of an action; prefer 〜始める/〜出す for that.\n  - Negative 〜ないようになる often implies loss of ability/opportunity or a situational shift; 〜なくなる is a shorter, more direct “stop/vanish.”\n- Scope:\n  - V(dict) + ようになる describes general tendency or routine now true.\n  - V(potential) + ようになる highlights acquisition or recovery of ability/permission.\n  - 〜ようになっている describes a designed/automatic mechanism, rule, or current arrangement.\n- Orthography:\n  - ように/ようになる is usually written in kana. 様に/様になる appears in formal writing; note that the set phrase 様になる can also mean “to look presentable,” which is a different nuance.\n\n### Common mistakes (optional, only if relevant)\n- Using ます-stem: use V(dict)/V(potential)/V(ない), not Vます + ようになる.\n- Using ようになる with adjectives/nouns (e.g., 高いようになる): use 高くなる／静かになる instead.\n- Confusing volition vs result: 〜ようにする (make an effort) vs 〜ようになる (it becomes so).\n- Overusing を with potential verbs; prefer が for the object with potential.\n- Redundancy/heaviness: overusing V(dict) + ことができる ようになる when a simple V(potential) + ようになる suffices.\n\n### Related grammar (optional, only if relevant)\n- 〜ようにする: deliberate effort (“try to/make sure to”); contrasts with the non-volitional/resultative 〜ようになる.\n- 〜始める／〜出す: start doing (onset of an action); more punctual than 〜ようになる.\n- 〜くなる／〜になる: “become ADJ/N”; use these for adjectives/nouns, not 〜ようになる.\n- 〜なくなる: “stop doing / no longer exist”; shorter and more neutral than V(ない)ようになる.\n- ことになる: “it is decided/turns out that …”; decision/outcome, not ability/habit change.",
  "examples": [
    {
      "jp": "一人暮らしを始めて、毎日自炊するようになった。",
      "en": "After I started living alone, I came to cook for myself every day."
    },
    {
      "jp": "練習のおかげで、少しずつピアノが弾けるようになりました。",
      "en": "Thanks to practice, I gradually became able to play the piano."
    },
    {
      "jp": "このごろは甘い物をあまり食べないようになった。",
      "en": "These days, I’ve come to not eat many sweets."
    },
    {
      "jp": "このドアは、カードをかざすと自動で開くようになっている。",
      "en": "This door is set up to open automatically when you hold up a card."
    },
    {
      "jp": "部長にも時間ができて、会議に来られるようになった。",
      "en": "The department head now has time and has become able to come to the meetings."
    },
    {
      "jp": "いつから朝早く起きるようになりましたか。",
      "en": "Since when did you come to get up early?"
    },
    {
      "jp": "怪我をしてから、走れないようになってしまいました。",
      "en": "Since getting injured, I’ve ended up unable to run."
    },
    {
      "jp": "設定を変えると、音声で操作することができるようになります。",
      "en": "If you change the settings, it becomes possible to operate it by voice."
    },
    {
      "jp": "だんだん人前で話せるようになった。",
      "en": "Little by little, I’ve become able to speak in front of others."
    },
    {
      "jp": "近道ができて、学校に歩いて来れるようになった。",
      "en": "A shortcut was made, and now I can walk to school."
    },
    {
      "jp": "年を取ると、夜更かしをしないようになります。",
      "en": "As you get older, you come to not stay up late."
    },
    {
      "jp": "未成年はこのアプリで買い物ができないようになっている。",
      "en": "This app is set so that minors cannot shop."
    },
    {
      "jp": "新しい眼鏡にして、遠くがよく見えるようになりました。",
      "en": "After getting new glasses, I became able to see far away clearly."
    },
    {
      "jp": "このアプリは、オフラインでも検索できるようになっていますか。",
      "en": "Is this app set up so that you can search even offline?"
    },
    {
      "jp": "次第に朝ごはんを食べるようになった。",
      "en": "Gradually, I came to eat breakfast."
    },
    {
      "jp": "週末は家で映画を観るようになりましたか。",
      "en": "Have you come to watch movies at home on weekends?"
    },
    {
      "jp": "新制度では、残業代が自動で計算されるようになっている。",
      "en": "Under the new system, overtime pay is set to be calculated automatically."
    },
    {
      "jp": "音読を続けたら、漢字が前より速く読めるようになった。",
      "en": "After continuing to read aloud, I became able to read kanji faster than before."
    },
    {
      "jp": "サーバーを移行して、夜中に自動バックアップが取れるようになりました。",
      "en": "After migrating the server, automatic backups can now be taken at night."
    },
    {
      "jp": "来月からは、予約がオンラインでも取れる様になります。",
      "en": "Starting next month, reservations will also be able to be made online."
    }
  ],
  "negativeExamples": [
    {
      "jp": "忘れないようにメモしておきます。",
      "en": "I’ll jot it down so I don’t forget."
    },
    {
      "jp": "毎日走るようにしている。",
      "en": "I make a point of running every day."
    },
    {
      "jp": "スーツを着たら、だいぶ様になったね。",
      "en": "Once you put on a suit, you look much more presentable."
    },
    {
      "jp": "子どものようになるのは簡単ではない。",
      "en": "Becoming like a child is not easy."
    },
    {
      "jp": "もっと早く起きられるように、目覚ましを二つかけている。",
      "en": "I set two alarms so I can get up earlier."
    },
    {
      "jp": "このドアは、自動で開くように設定した。",
      "en": "I set the door to open automatically."
    },
    {
      "jp": "上司に遅刻しないようにと言われた。",
      "en": "My boss told me not to be late."
    },
    {
      "jp": "このアプリはオフラインでも検索できるようにしてあります。",
      "en": "This app has been set up so it can be searched even offline."
    },
    {
      "jp": "来月から在宅勤務ということになりました。",
      "en": "It’s been decided that I’ll be working from home starting next month."
    },
    {
      "jp": "午後から雨のようです。",
      "en": "It looks like it will rain in the afternoon."
    }
  ]
}