{
  "id": "n5.noun-ni-kaerimasu",
  "level": "N5",
  "description": "Express going back or returning to a place: 'to return to', 'to go back to'",
  "formation": "Noun + に + 帰ります",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- Nに帰る（帰ります）\n\n### Meaning and function\n- Expresses returning or going back to a destination, typically one’s “base” such as home, country, school, or company\n- Often implies “go home” when the destination is home\n\n### Form and templates\n- N(place) + に + 帰る／帰ります\n- Alternatives:\n  - N(place) + へ + 帰る／帰ります（へ emphasizes direction; に is more common/natural for a concrete destination）\n- With time/origin (order is flexible):\n  - Time + に + N(place) + に + 帰る（two に are fine: one for time, one for destination）\n  - N(origin) + から + N(destination) + に + 帰る\n- Conjugation (帰る is a godan verb):\n  - Polite: 帰ります\n  - Negative: 帰らない／帰りません\n  - Past: 帰った／帰りました\n  - Negative past: 帰らなかった／帰りませんでした\n  - Te-form: 帰って\n\n### Usage notes and constraints\n- Destination must be a place; typical nouns: 家／うち, 国, 学校, 会社, 部屋, 実家\n- Semantics:\n  - 帰る is used for returning to one’s own base or usual place; for going to arbitrary places (shops, a friend’s house you don’t live in), use 行く\n  - Not used for returning objects (that is 返す) or for abstract “return to work” (戻る fits “go back” to a previous place/state/task)\n- に vs へ:\n  - に marks a specific destination (more common with 帰る)\n  - へ is acceptable and slightly more directional; written へ, pronounced “e”\n- Omissions:\n  - The destination can be omitted when obvious from context (e.g., “go home”)\n- Time expressions:\n  - Time + に can co-occur with place + に\n  - For deadlines, use までに (e.g., “be back by …”)\n- Register/frequency:\n  - Very common in everyday speech; both plain (帰る) and polite (帰ります) are used\n- Orthography/word choice:\n  - 家 (いえ) vs うち: うち often means “my home” in casual speech; 家 is neutral/the building\n  - Kanji: 帰る for “return (home)”; 返る is a different verb meaning “to be returned/revert” and is not used for going home\n\n### Common mistakes (optional, only if relevant)\n- Using で to mark the destination instead of に／へ\n- Using 来る when you mean “go back” from your current location (use 帰る, not 来る)\n- Marking a person as destination (母に帰る); use a place (母の家に／実家に, etc.)\n- Confusing 帰る with 返す／返る (return something/revert)\n- Assuming に can’t repeat: time + に and place + に can appear together\n\n### Related grammar (optional, only if relevant)\n- Nに／へ行く: go to a destination (neutral “go,” not “return” to one’s base)\n- Nに／へ来る: come to a destination (toward the speaker’s location)\n- Nから帰る: return from a place (origin marked with から)\n- Nに戻る: go back/return to a previous place or state (neutral “go back,” not necessarily “home”)\n- 帰宅する: formal/sino-Japanese verb meaning “return home” (more formal than 帰る)",
  "examples": [
    {
      "jp": "今日はまっすぐ家に帰ります。",
      "en": "I’ll go straight home today."
    },
    {
      "jp": "昨日は九時にうちに帰った。",
      "en": "I went home at nine yesterday."
    },
    {
      "jp": "明日、国へ帰ります。",
      "en": "I’m going back to my country tomorrow."
    },
    {
      "jp": "まだ仕事中だから、私は家に帰らない。",
      "en": "I’m still working, so I’m not going home."
    },
    {
      "jp": "何時に家に帰りますか。",
      "en": "What time will you go home?"
    },
    {
      "jp": "会議が長引いたので、早く実家へ帰りませんでした。",
      "en": "The meeting ran long, so I didn’t go back to my parents’ home early."
    },
    {
      "jp": "学校からうちに帰る途中で、パンを買った。",
      "en": "On the way home from school, I bought some bread."
    },
    {
      "jp": "すみません、先に帰ります。",
      "en": "Sorry, I’ll head home first."
    },
    {
      "jp": "父は長い出張のあと、国に帰りました。",
      "en": "After a long business trip, my father returned to his country."
    },
    {
      "jp": "日曜の夜までに家に帰ってください。",
      "en": "Please be home by Sunday night."
    },
    {
      "jp": "新学期が始まる前に、実家に帰ったほうがいい？",
      "en": "Should I go back to my parents’ home before the new term starts?"
    },
    {
      "jp": "フロアが静かなので、部屋へ静かに帰って。",
      "en": "It’s quiet on the floor, so please go back to your room quietly."
    },
    {
      "jp": "祖父母の住む町の実家に、夏に帰ります。",
      "en": "I’ll go back to my family home in the town where my grandparents live in the summer."
    },
    {
      "jp": "まだ作業があるので、うちに帰りません。",
      "en": "I won’t go home yet because I still have work to do."
    },
    {
      "jp": "兄は海外から国に帰って、すぐに母に電話した。",
      "en": "My older brother returned to his country from overseas and immediately called our mother."
    },
    {
      "jp": "今夜は家に帰らなかった。",
      "en": "I didn’t go home tonight."
    },
    {
      "jp": "今日の午後三時に学校へ帰りましたか。",
      "en": "Did you return to school at 3 p.m. today?"
    },
    {
      "jp": "子どもたちは遊び終わると、うちに帰った。",
      "en": "When the children finished playing, they went home."
    },
    {
      "jp": "ここから駅前の寮に帰るには、バスが一番早い。",
      "en": "To get back to the dorm in front of the station from here, the bus is the fastest."
    },
    {
      "jp": "じゃあ、もう帰る？",
      "en": "So, are you going home now?"
    }
  ],
  "negativeExamples": [
    {
      "jp": "もう家に行きます。",
      "en": "I’m going to the house now."
    },
    {
      "jp": "彼は九時に家へ来ますか。",
      "en": "Will he come to the house at nine?"
    },
    {
      "jp": "図書を図書館に返す。",
      "en": "I’ll return the books to the library."
    },
    {
      "jp": "その色は元に返った。",
      "en": "The color returned to its original state."
    },
    {
      "jp": "家へ戻りました。",
      "en": "I went back to the house."
    },
    {
      "jp": "毎晩七時に帰宅します。",
      "en": "I go home at seven every night."
    },
    {
      "jp": "お帰りなさい。",
      "en": "Welcome back."
    },
    {
      "jp": "帰り道でコンビニに寄った。",
      "en": "I stopped by a convenience store on the way back."
    },
    {
      "jp": "今日は客先から直帰します。",
      "en": "I’ll go straight home from the client’s site today."
    },
    {
      "jp": "明日は家にいません。",
      "en": "I won’t be at home tomorrow."
    }
  ]
}