{
  "id": "n5.ru-mae-ni",
  "level": "N5",
  "description": "Used to express 'before' in a sense of an action must be done before another action or event",
  "formation": "Verb (dictionary form) + 前に",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- 〜前に（V辞書形／Nの）\n\n### Meaning and function\n- States that one action or time happens earlier than another: do B before A; prior to N, do B\n\n### Form and templates\n- V(辞書形) + 前に, …  \n  - Use the plain, non‑past (dictionary) form before 前に, regardless of past/present in the main clause\n  - Do not use ます‑form, た‑form, or negative form before 前に\n- N + の + 前に, …  \n  - N must be an event/time noun (e.g., meals, meetings, times). With place nouns, Nの前に usually means “in front of N” (spatial), not “before N” (temporal)\n- 前 is a noun; the particle after it changes by function:\n  - 前に = at the time “before …” (most common)\n  - 前は (topic), 前も (also), 前から/前まで (range), 前の + N (modifier: “the N before …”)\n- する‑nouns:\n  - Either Nの前に or N(を)する前に is possible; both are natural with action/event nouns\n- Time-distance “ago” (related usage of 前に):\n  - 数＋時間名詞（分・時間・日・年 など）＋前に = “… ago” (the main verb is typically in the past)\n\n### Usage notes and constraints\n- Register: Neutral and very common in speech and writing. The clause before 前に is always plain form; the main clause can be plain or polite\n- Scope/semantics:\n  - Expresses relative order only (“earlier than”); it does not by itself imply completion or immediate sequence (compare 〜てから for “after doing (and then) …”)\n  - Even when talking about the past, keep V(辞書形) before 前に (not Vた)\n- Word order and particles:\n  - Objects, places, times, etc., belong inside the clause before 前 (…を/で/に V) → V(辞書形) 前に\n  - You cannot insert の after a verb: use V(辞書形)前に, not V(辞書形)の前に\n- Nの前に (temporal) vs spatial “in front of”:\n  - With event/time nouns, Nの前に = “before N (time/event)”\n  - With place nouns, Nの前に typically means location “in front of N” (spatial); use event/time nouns to avoid ambiguity\n- Negative “before”:\n  - Don’t use Vない前に to mean “before not doing …”; use Vないで／ずに for “without doing …” and use V(辞書形)前に for the reference event itself\n- Deadlines vs “before”:\n  - For a deadline (“by …”), use 〜までに, not 〜前に\n- “Becoming/starting” times:\n  - For phases like “before it becomes …,” use V(になる)前に (e.g., “before it gets dark” type meanings)\n- Orthography:\n  - Usually written 前に (reading: まえに). In signs/labels, N前に (without の) also appears (e.g., “食前に”), but in everyday speech Nの前に is standard\n\n### Common mistakes (optional, only if relevant)\n- Using ます‑form or た‑form before 前に (should be plain non‑past)\n- Inserting の after a verb: Vの前に (incorrect) instead of V前に\n- Using Vない前に to mean “without doing …” (use Vないで/ずに instead)\n- Saying Nの前に with a place noun when you mean a time/event (it will be read as spatial “in front of …”)\n- Forgetting の between a noun and 前に (N前に is mostly formal/shorthand; conversationally Nの前に)\n\n### Related grammar (optional, only if relevant)\n- 〜てから: “after doing … (and then …)”; emphasizes sequence after completion\n- 〜あとで: “after …”; broader “later than …” without sequence nuance\n- 〜までに: “by … (deadline)”; not a relative ordering between two actions\n- 〜うちに: “while/as long as …” (do B before the situation changes); often used where Vない前に is misapplied\n- 先に: adverb “first/beforehand”; does not take a clause like V前に does",
  "examples": [
    {
      "jp": "出かける前に窓を閉めます。",
      "en": "Before going out, I close the windows."
    },
    {
      "jp": "会議の前に上司に確認しました。",
      "en": "Before the meeting, I checked with my boss."
    },
    {
      "jp": "元気になる前に無理をしないでください。",
      "en": "Please don’t push yourself before you get better."
    },
    {
      "jp": "出発する前に天気を確認しませんでした。",
      "en": "I didn’t check the weather before departing."
    },
    {
      "jp": "雨が降り出す前に帰る。",
      "en": "I’ll head home before it starts to rain."
    },
    {
      "jp": "友だちに連絡する前に予定を確認したほうがいい。",
      "en": "You should check your schedule before contacting a friend."
    },
    {
      "jp": "暗くなる前に家に着きたい。",
      "en": "I want to get home before it gets dark."
    },
    {
      "jp": "帰る前に誰にも言わなかった。",
      "en": "I didn’t tell anyone before leaving."
    },
    {
      "jp": "出かける前にゴミを出しますか。",
      "en": "Do you take out the trash before you go out?"
    },
    {
      "jp": "帰る前に先生に挨拶しましたか。",
      "en": "Did you greet the teacher before going home?"
    },
    {
      "jp": "試験の前にもう一度復習する？",
      "en": "Will you review once more before the exam?"
    },
    {
      "jp": "寝る前にコーヒーは飲まない？",
      "en": "Don’t drink coffee before bed?"
    },
    {
      "jp": "食べる前は必ず手を洗います。",
      "en": "Before eating, I always wash my hands."
    },
    {
      "jp": "出発する前も、チェックリストを丁寧に確認した。",
      "en": "Even before we departed, I carefully went through the checklist."
    },
    {
      "jp": "映画が始まる前から客席はかなり賑やかだった。",
      "en": "The audience area was already quite lively even before the movie started."
    },
    {
      "jp": "雨が降り始める前まで外で遊んでいました。",
      "en": "We were playing outside until just before it started to rain."
    },
    {
      "jp": "試合が始まる前の緊張が一番つらい。",
      "en": "The tension before a game is the hardest part."
    },
    {
      "jp": "運動をする前に軽くストレッチをしておきましょう。",
      "en": "Before exercising, let’s do a light stretch."
    },
    {
      "jp": "面接の前に志望動機をもう一度まとめておく。",
      "en": "Before the interview, I’ll go over my reason for applying once more."
    },
    {
      "jp": "食前にお薬を一錠お飲みください。",
      "en": "Please take one tablet before meals."
    }
  ],
  "negativeExamples": [
    {
      "jp": "駅の前に小さなパン屋があります。",
      "en": "There is a small bakery in front of the station."
    },
    {
      "jp": "学校の前には桜の木が並んでいる。",
      "en": "Cherry trees line the area in front of the school."
    },
    {
      "jp": "家の前は車通りが少ない。",
      "en": "The street in front of my house has little traffic."
    },
    {
      "jp": "図書館の前まで歩いて五分です。",
      "en": "It’s a five-minute walk to the front of the library."
    },
    {
      "jp": "三年前にここへ引っ越してきました。",
      "en": "I moved here three years ago."
    },
    {
      "jp": "二十分前に電話がありました。",
      "en": "There was a call twenty minutes ago."
    },
    {
      "jp": "一歩前に出てください。",
      "en": "Please step forward one step."
    },
    {
      "jp": "会議までに資料を仕上げます。",
      "en": "I’ll finish the materials by the meeting."
    },
    {
      "jp": "宿題をしてからゲームをします。",
      "en": "I’ll play games after doing my homework."
    },
    {
      "jp": "食事のあとで散歩しましょう。",
      "en": "Let’s take a walk after the meal."
    }
  ]
}