{
  "id": "n5.toki",
  "level": "N5",
  "description": "Expresses the time when something happens, 'when', 'at the time'",
  "formation": "Verb-casual + とき / い-Adjective + とき / な-Adjective + なとき / Noun + のとき",
  "priority": 10,
  "pattern": {
    "sequence": []
  },
  "explanation": "### Name\n- 〜とき\n\n### Meaning and function\n- Marks the time when something happens; “when …,” “at the time (that) ….” It sets a time frame for the main event.\n\n### Form and templates\n- Core: [Clause in plain (dictionary) form] + とき (+ に/は/も/には) + main clause\n- Verbs:\n  - V-る とき … (before/during that action/state)\n  - V-た とき … (after that action is completed)\n  - V-ない とき … / V-なかった とき …\n- い-adjectives:\n  - い-adj とき … / い-adj かった とき …\n  - い-adj くない とき … / い-adj くなかった とき …\n- な-adjectives:\n  - な-adj な とき …\n  - な-adj だった とき …\n  - な-adj じゃない とき … / な-adj じゃなかった とき …\n- Nouns:\n  - N の とき …\n  - N だった とき …\n  - N じゃない とき … / N じゃなかった とき …\n- Particles after とき:\n  - に: marks a specific point/occasion in time (more punctual/specific)\n  - は: topicalizes/contrasts that time (general statements/habits)\n  - には, も: combinations for emphasis or “also”\n- Conjugation/ordering:\n  - The clause before とき must be in plain form (not です/ます).\n  - The main clause can be plain or polite.\n  - For future reference, use non-past (V-る) before とき.\n\n### Usage notes and constraints\n- Register and frequency: Neutral and very common in all registers. Safe for everyday use.\n- Semantic scope:\n  - V-る とき: the main event happens before or during the action/state in the とき-clause.\n  - V-た とき: the main event happens after that action/state is completed.\n  - With nouns/な-adjectives, の/な describe a current/general state; だった makes the time explicitly past.\n- Particle choice:\n  - とき alone is fine. Add に for a specific occurrence; use は for general conditions or contrast. には combines both nuances.\n- Orthography:\n  - とき and 時 are both standard. 時 is common in writing; とき is beginner-friendly or for readability.\n\n### Common mistakes (optional, only if relevant)\n- Using です/ます before とき instead of plain forms.\n- Writing な-adjectives as …のとき (should be …なとき).\n- Writing nouns as …なとき (should be …のとき) unless using だった for a predicate noun.\n- Confusing V-る とき and V-た とき, leading to the wrong time relation.\n- Overusing に or inserting it in the wrong place (attach it after とき, not before it).\n\n### Related grammar (optional, only if relevant)\n- 〜たら: “when/if/after.” Stronger sense of “after” in past contexts; also conditional.\n- 〜と: “when/whenever” for predictable results and habitual truths; not used for one-off past events.\n- 〜間（あいだ）: “while/during,” emphasizes overlapping duration, not a single time point.\n- 〜ところ: “at the moment/just as,” focuses on the immediate stage (before/during/after) of an action.\n- 〜際（に）: Formal counterpart to とき, used in official notices and writing.",
  "examples": [
    {
      "jp": "家を出るとき、鍵を確認します。",
      "en": "When I leave the house, I check my keys."
    },
    {
      "jp": "日本に着いた時、雪が降っていた。",
      "en": "When I arrived in Japan, it was snowing."
    },
    {
      "jp": "電車が来なかったときには、タクシーを呼びました。",
      "en": "When the train didn’t come, I called a taxi."
    },
    {
      "jp": "寒いときも、散歩しますか。",
      "en": "Do you go for walks even when it’s cold?"
    },
    {
      "jp": "忙しかったときは、友だちに会えなかった。",
      "en": "When I was busy, I couldn’t meet my friends."
    },
    {
      "jp": "暑くないとき、窓を開けてもいいですか。",
      "en": "When it’s not hot, is it okay to open the window?"
    },
    {
      "jp": "痛くなかったときは、病院に行かなかった。",
      "en": "When it didn’t hurt, I didn’t go to the hospital."
    },
    {
      "jp": "元気なときに、遠くまで走ります。",
      "en": "When I’m feeling well, I run far."
    },
    {
      "jp": "部屋が静かだった時、集中できました。",
      "en": "When the room was quiet, I was able to concentrate."
    },
    {
      "jp": "暇じゃないときには、返信が遅れます。",
      "en": "When I’m not free, my replies are slow."
    },
    {
      "jp": "便利じゃなかったときも、我慢した。",
      "en": "Even when it wasn’t convenient, I put up with it."
    },
    {
      "jp": "子どものとき、祖父の家によく泊まった。",
      "en": "When I was a child, I often stayed at my grandpa’s house."
    },
    {
      "jp": "学生だったとき、図書館でアルバイトをしていました。",
      "en": "When I was a student, I worked part-time at the library."
    },
    {
      "jp": "休みじゃないときは、店は開いています。",
      "en": "When it’s not a holiday, the shop is open."
    },
    {
      "jp": "晴れじゃなかったときには、試合は中止でした。",
      "en": "When it wasn’t sunny, the game was canceled."
    },
    {
      "jp": "次に会うときに、写真を見せます。",
      "en": "When we meet next time, I’ll show you the photos."
    },
    {
      "jp": "運転するときは、スマホを見ないでください。",
      "en": "When driving, please don’t look at your phone."
    },
    {
      "jp": "友だちが家に来たとき、父はちょうど帰ってきた。",
      "en": "When my friend came over, my father happened to come home."
    },
    {
      "jp": "雨のときは、道路が混みますか。",
      "en": "When it’s rainy, do the roads get crowded?"
    },
    {
      "jp": "手が離せないときは、電話に出ません。",
      "en": "When my hands are full, I don’t answer the phone."
    }
  ],
  "negativeExamples": [
    {
      "jp": "時には休むことも大切だ。",
      "en": "At times, taking a break is important."
    },
    {
      "jp": "その時、電話が鳴った。",
      "en": "At that moment, the phone rang."
    },
    {
      "jp": "雨の際には足元にご注意ください。",
      "en": "In case of rain, please watch your step."
    },
    {
      "jp": "出発の際、パスポートをご提示ください。",
      "en": "At the time of departure, please present your passport."
    },
    {
      "jp": "忙しいところ悪いけど、これお願いできる？",
      "en": "Sorry to bother you when you’re busy, but could you do this?"
    },
    {
      "jp": "子どものころは山で遊んだ。",
      "en": "When I was a child, I played in the mountains."
    },
    {
      "jp": "約束したら、必ず守りなさい。",
      "en": "If you make a promise, be sure to keep it."
    },
    {
      "jp": "ドアを開けると、猫が走ってきた。",
      "en": "When I opened the door, a cat ran over."
    },
    {
      "jp": "「暇なとき」という言葉は曖昧だ。",
      "en": "The phrase “when I’m free” is vague."
    },
    {
      "jp": "静かな時です。",
      "en": "It is a quiet time."
    }
  ]
}